<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1040;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1082;&#1072; &#1074; &#1087;&#1086;&#1083;&#1103;&#1093; &#1043;&#1072;&#1083;&#1091;&#1072;</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="zz"><link rel="up" href="chapter1.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;"><link rel="prev" href="matrix.html" title="&#1057;&#1051;&#1040;&#1059;"><link rel="next" href="chapter2.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="arithm"></a>&#1040;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1082;&#1072; &#1074; &#1087;&#1086;&#1083;&#1103;&#1093; &#1043;&#1072;&#1083;&#1091;&#1072;</h2></div></div></div><div class="section"><div class="titlepage"></div><p>&#8592; <a class="link" href="matrix.html" title="&#1057;&#1051;&#1040;&#1059;">&#1057;&#1051;&#1040;&#1059;</a></p><p><a class="link" href="chapter1.html#intro" title="&#1042;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;">&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</a></p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="arithm_intro"></a>&#1042;&#1089;&#1090;&#1091;&#1087;&#1083;&#1077;&#1085;&#1080;&#1077;</h3></div></div></div><p>
				&#1042;&#1099;&#1096;&#1077; &#1073;&#1099;&#1083;&#1086; &#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;, &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086;-&#1073;&#1099; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;
				</p><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;</h3>
					&#1059;&#1075;&#1091;. &#1041;&#1099;&#1083;&#1086;-&#1073;&#1099;. &#1053;&#1086; &#1053;&#1045;&#1051;&#1068;&#1047;&#1071;. &#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1074;&#1089;&#1105; &#1074;&#1099;&#1096;&#1077;&#1080;&#1079;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086;
					&#1089;&#1084;&#1099;&#1089;&#1083;&#1072;, &#1072; &#1083;&#1080;&#1096;&#1100; &#1075;&#1086;&#1083;&#1072;&#1103;, &#1080; &#1085;&#1077;&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1072;&#1103; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1090;&#1077;&#1086;&#1088;&#1080;&#1103;. &#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1074; &#1089;&#1072;&#1084;&#1080;&#1080;&#1093; &#1095;&#1080;&#1089;&#1083;&#1072;&#1093;,
					&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103; &#1074;&#1099;&#1096;&#1077; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1083; "&#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;&#1080;", &#1090;.&#1077; &#1085;&#1077;&#1082;&#1086;&#1081; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1090;&#1085;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;&#1102;,
					&#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1085;&#1077;&#1090; &#1080;&#1079;&#1100;&#1103;&#1085;&#1072;.
				</div><p>
			</p><p>
				&#1050; &#1084;&#1086;&#1077;&#1084;&#1091; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1086;&#1084;&#1091; &#1089;&#1086;&#1078;&#1077;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1074; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1083;&#1072;&#1093;, &#1077;&#1089;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; "&#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1081;" &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1086;&#1082;: &#1048;&#1061; &#1053;&#1045;&#1058;.
			</p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="idm139835489186192"></a>&#1058;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1099; &#1076;&#1091;&#1084;&#1072;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1084;&#1099; &#1080;&#1093; &#1080;&#1084;&#1077;&#1083;&#1080;</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489185584"></a>&#1053;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072;</h4></div></div></div><p>
					&#1053;&#1072;&#1095;&#1085;&#1105;&#1084; &#1084;&#1099; &#1089; &#1085;&#1072;&#1095;&#1072;&#1083;&#1072;, &#1072; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1089; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083;, &#1090;.&#1077;. &#1089; &#1095;&#1080;&#1089;&#1077;&#1083; 1,2,3,4,5&#8230;
					</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3>
						&#1041;&#1091;&#1076;&#1077;&#1084; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; 0 &#1085;&#1077; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083;.
					</div><p>
				</p><p>
					&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1074; &#1080;&#1093; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1084; &#1085;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080;. &#1053;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1073;&#1077;&#1089;&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;. &#1069;&#1090;&#1086; &#1085;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1090; &#1086;&#1089;&#1086;&#1073;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;,
					&#1087;&#1086;&#1082;&#1072; &#1084;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1084; &#1089; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086;&#1084; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1048; &#1073;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1075;&#1086;: &#1085;&#1072;&#1096;&#1077; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083;
					&#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084; <span class="emphasis"><em>&#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;</em></span>, &#1090;.&#1077;. &#1084;&#1099; &#1079;&#1085;&#1072;&#1077;&#1084;, &#1082;&#1072;&#1082;&#1086;&#1077; &#1080;&#1079; &#1085;&#1080;&#1093; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1072; &#1082;&#1072;&#1082;&#1086;&#1077;
					&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;. &#1069;&#1090;&#1086; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;, &#1080; &#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1084;.
				</p><p>
					&#1045;&#1089;&#1083;&#1080; &#1089;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1087;&#1072;&#1088;&#1091; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083;, &#1090;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086;&#1095;&#1090;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;,
					&#1082;&#1072;&#1082; &#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;. &#1058;&#1086;&#1095;&#1085;&#1077;&#1077;, &#1089;&#1091;&#1084;&#1084;&#1072; &#1076;&#1074;&#1091;&#1093; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; N &#1073;&#1080;&#1090; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; N &#1080;&#1083;&#1080; N+1 &#1073;&#1080;&#1090;.
				</p><p>
					&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086; &#1089;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1085;&#1077; &#1073;&#1086;&#1103;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1077;&#1097;&#1105;
					&#1082;&#1072;&#1082;&#1080;&#1093;-&#1090;&#1086; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;.
					</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3><p>
							&#1050;&#1086;&#1083;&#1100;&#1094;&#1086;&#1084; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1095;&#1080;&#1089;&#1077;&#1083;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; <span class="emphasis"><em>&#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1086;</em></span> &#1087;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1102; &#1082;
							&#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1086; &#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1102; &#1082; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1102;.
							&#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086; &#1090;&#1086;&#1075;&#1076;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1079;&#1072;&#1084;&#1099;&#1082;&#1072;&#1102;&#1097;&#1080;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085; &#1074;&#1086; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;
							&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;.
						</p><p>
							&#1058;.&#1077;. &#1076;&#1083;&#1103; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083;, &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;, &#1080;
							&#1082;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084;.
						</p></div><p>
					</p><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;</h3>
						&#1069;&#1090;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;, &#1085;&#1086; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;. &#1053;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;,
						&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086;&#1084; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;.
					</div><p>
				</p></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489176384"></a>&#1062;&#1077;&#1083;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072;</h4></div></div></div><p>
					&#1044;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1083;&#1100;&#1094;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; <span class="emphasis"><em>&#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1081;</em></span> &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1086;&#1089;&#1090;&#1080; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;.
					&#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1084;&#1082;&#1085;&#1091;&#1090;&#1086; <span class="emphasis"><em>&#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;</em></span>. &#1058;.&#1077;. &#1077;&#1089;&#1083;&#1080; &#1084;&#1099; &#1080;&#1076;&#1105;&#1084; &#1087;&#1086; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1091; "&#1074;&#1087;&#1077;&#1088;&#1105;&#1076;",
					&#1090;&#1086; &#1084;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080;-&#1073;&#1099; &#1080; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; "&#1085;&#1072;&#1079;&#1072;&#1076;", &#1087;&#1088;&#1080;&#1095;&#1105;&#1084; <span class="emphasis"><em>&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;</em></span>.
				</p><p>
					&#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; &#1090;&#1072;&#1082;&#1080;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084; &#1053;&#1045; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090;: "&#1074;&#1087;&#1077;&#1088;&#1105;&#1076;" &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1076;&#1090;&#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;, &#1072; &#1074;&#1086;&#1090;
					"&#1085;&#1072;&#1079;&#1072;&#1076;" &#8212; &#1091;&#1074;&#1099;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1077;&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; 10 &#1077;&#1076;&#1080;&#1085;&#1080;&#1094; &#1085;&#1072;&#1079;&#1072;&#1076; &#1086;&#1090; 3?
				</p><p>
					&#1069;&#1090;&#1086; &#1085;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100;, &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1074; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; "&#1074;&#1085;&#1080;&#1079;", "&#1076;&#1086;" &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1099;.
				</p><p>
					&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1089;&#1103; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; <span class="emphasis"><em>&#1094;&#1077;&#1083;&#1099;&#1093;</em></span> &#1095;&#1080;&#1089;&#1077;&#1083;: 0, ±1, ±2, ±3&#8230;.
				</p><p>
					&#1058;&#1072;&#1082;&#1086;&#1077; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1094;&#1077;&#1083;&#1099;&#1093; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1094;&#1077;&#1085;&#1085;&#1099;&#1084; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086;&#1084;, &#1089; &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1099;&#1084; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;,
					&#1080; &#1089; &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1099;&#1084; <span class="emphasis"><em>&#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1085;&#1080;&#1077;&#1084;</em></span>, &#1090;.&#1077;. &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
					&#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081; &#1082; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1102;.
				</p></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489169408"></a>&#1053;&#1077;&#1081;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;</h4></div></div></div>
				&#1050;&#1086;&#1083;&#1100;&#1094;&#1086; &#1094;&#1077;&#1083;&#1099;&#1093; &#1080;&#1084;&#1077;&#1077;&#1090; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1077;&#1081;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#8212; &#1085;&#1086;&#1083;&#1100;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;/&#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1085;&#1080;&#1103; &#1089; &#1085;&#1080;&#1084;,
				&#1083;&#1102;&#1073;&#1086;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; <span class="emphasis"><em>&#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;</em></span>.
				<div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;</h3>
					&#1069;&#1090;&#1086; &#1087;&#1086;&#1088;&#1086;&#1078;&#1076;&#1072;&#1077;&#1090; &#1085;&#1077;&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1074;&#1077;&#1076;&#1100; &#1077;&#1089;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1090;, &#1090;&#1086; &#1083;&#1102;&#1073;&#1072;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;
					&#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1072;, &#1072; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1077;&#1105; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
					&#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1072;&#1078;&#1077; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100;, &#1073;&#1099;&#1083;&#1072; &#1086;&#1087;&#1088;&#1072;&#1094;&#1080;&#1103;, &#1080; &#1077;&#1089;&#1083;&#1080; &#1073;&#1099;&#1083;&#1072;, &#1090;&#1086; &#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;?
				</div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489166912"></a>&#1059;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;</h4></div></div></div><p>
					&#1059;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1094;&#1077;&#1083;&#1099;&#1093; &#1095;&#1080;&#1089;&#1083;&#1072;&#1093; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1085;&#1086;, &#1082;&#1072;&#1082; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1076; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;:
					&#1076;&#1083;&#1103; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; X &#1085;&#1072; Y, &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; X &#1089; &#1089;&#1072;&#1084;&#1080;&#1084; &#1089;&#1086;&#1073;&#1086;&#1081; Y &#1088;&#1072;&#1079;.
				</p><p>
					&#1053;&#1072;&#1074;&#1077;&#1088;&#1085;&#1086;&#1077; &#1101;&#1090;&#1086; &#1085;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1085;&#1103;&#1090;&#1085;&#1086;&#1077; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1085;&#1086; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077; &#1074;&#1099; &#1089;&#1072;&#1084;&#1080; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077;,
					&#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1080; &#1085;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1074;&#1077;&#1088;&#1085;&#1086;&#1077;. &#1063;&#1090;&#1086; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1077;&#1089;&#1090;&#1100; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#8212; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;.
					&#1071; &#1076;&#1091;&#1084;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1074;&#1099;&#1096;&#1077; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1077;&#1074;&#1085;&#1103;&#1090;&#1085;&#1086;&#1077; &#1088;&#1077;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1085;&#1086;&#1077; &#1086;&#1073;&#1098;&#1103;&#1089;&#1085;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1089;&#1072;&#1084;&#1091; &#1089;&#1091;&#1090;&#1100;
					&#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
				</p><p>
					&#1048; &#1090;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1076;&#1083;&#1103; &#1094;&#1077;&#1083;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; &#1074;&#1089;&#1105; &#1087;&#1088;&#1086;&#1097;&#1077;: &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1094;&#1077;&#1083;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;
					&#1089;&#1086;&#1073;&#1086;&#1081; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; <span class="emphasis"><em>&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;</em></span>, &#1085;&#1086; &#1080; <span class="emphasis"><em>&#1085;&#1086;&#1084;&#1077;&#1088;</em></span>,
					&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;: &#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, &#1095;&#1080;&#1089;&#1083;&#1086; 17 &#1101;&#1090;&#1086; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 17, &#1085;&#1086; &#1080; &#1085;&#1077;&#1082;&#1072;&#1103;
					&#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1079;&#1072;&#1076;&#1072;&#1105;&#1090; 17 &#1086;&#1076;&#1080;&#1085;&#1072;&#1082;&#1086;&#1074;&#1099;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;/&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;, &#1085;&#1091; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;
					^^^^^^^^^^^^^^^^^. &#1058;&#1091;&#1090; 17 &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; «^».
				</p><p>
					&#1052;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084; &#1085;&#1072;&#1076;&#1077;&#1103;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1074;&#1077;&#1088;&#1085;&#1086; &#1074; &#1083;&#1102;&#1073;&#1099;&#1093; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072;&#1093;, &#1085;&#1086; &#1074;&#1086; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1077;
					&#1094;&#1077;&#1083;&#1099;&#1093; &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;. &#1055;&#1086;&#1090;&#1086;&#1084;&#1091;(&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086; &#1101;&#1090;&#1086;&#1084;&#1091;) &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1095;&#1105;&#1090;&#1082;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;,
					&#1082;&#1072;&#1082; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086;&#1077; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1076; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086;&#1084; &#1094;&#1077;&#1083;&#1099;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083;.
				</p><p>
					&#1053;&#1077;&#1074;&#1085;&#1103;&#1090;&#1085;&#1086;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#8212; &#1101;&#1090;&#1086; &#1089;&#1072;&#1084;&#1072;&#1103; &#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1103; &#1073;&#1077;&#1076;&#1072; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1091;&#1076;&#1072; &#1082;&#1072;&#1082; &#1093;&#1091;&#1078;&#1077; &#1077;&#1105;
					&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1077; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;. &#1055;&#1088;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1084; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1074; &#1082;&#1086;&#1083;&#1100;&#1094;&#1077; &#1094;&#1077;&#1083;&#1099;&#1093; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;
					&#1059;&#1042;&#1045;&#1051;&#1048;&#1063;&#1048;&#1042;&#1040;&#1045;&#1058;&#1057;&#1071;. &#1058;.&#1077;. &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1073;&#1080;&#1090; &#1087;&#1088;&#1080; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1076;&#1074;&#1091;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; &#1059;&#1044;&#1042;&#1040;&#1048;&#1042;&#1040;&#1045;&#1058;&#1057;&#1071;.
				</p><p>
					&#1058;.&#1086;. &#1087;&#1086;&#1089;&#1083;&#1077; 10(&#1076;&#1077;&#1089;&#1103;&#1090;&#1080;) &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1105;&#1090; &#1074; &#1084;&#1080;&#1083;&#1083;&#1080;&#1086;&#1085; &#1088;&#1072;&#1079;,
					&#1090;&#1086;&#1095;&#1085;&#1077;&#1077; &#1074; 1`048`576 &#1088;&#1072;&#1079;.
					</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3>
						&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1090;&#1072;&#1082;&#1072;&#1103; &#1073;&#1077;&#1076;&#1072; &#1087;&#1086;&#1089;&#1090;&#1080;&#1075;&#1085;&#1077;&#1090; &#1083;&#1080;&#1096;&#1100; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1089;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1088;&#1086;&#1076;&#1077;
						&#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1086;&#1081;, &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1086;&#1081;, &#1096;&#1077;&#1089;&#1085;&#1072;&#1076;&#1094;&#1077;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1086;&#1081; &#1080; &#1090;&#1072;&#1082; &#1076;&#1072;&#1083;&#1077;&#1077;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1076;&#1091;&#1084;&#1072;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1089;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103;,
						&#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1090;&#1072;&#1082;&#1086;&#1081; &#1073;&#1077;&#1076;&#1099; &#1085;&#1077;&#1090;. &#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1090;&#1072;&#1084; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1073;&#1077;&#1076;&#1099;. &#1042;&#1087;&#1088;&#1086;&#1095;&#1077;&#1084;, &#1084;&#1099; &#1089;&#1077;&#1081;&#1095;&#1072;&#1089;
						&#1101;&#1090;&#1080;&#1084; &#1080; &#1079;&#1072;&#1081;&#1084;&#1105;&#1084;&#1089;&#1103;&#8230;
					</div><p>
				</p><p>
					&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1076;&#1072;&#1078;&#1077; &#1085;&#1077; &#1074; &#1089;&#1072;&#1084;&#1086;&#1084; &#1101;&#1090;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1072;
					&#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1085;&#1077; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084;-&#1090;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;.
				</p><p>
					&#1053;&#1072; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076;, &#1101;&#1090;&#1086; &#1079;&#1074;&#1091;&#1095;&#1080;&#1090; &#1073;&#1088;&#1077;&#1076;&#1086;&#1084;: &#1095;&#1080;&#1089;&#1083;&#1086; &#1073;&#1080;&#1090; <span class="emphasis"><em>&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093;</em></span> &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;
					&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1091;&#1076;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1085;&#1086; &#1095;&#1080;&#1089;&#1083;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#8212; &#1085;&#1077;&#1090;? &#1056;&#1072;&#1079;&#1075;&#1072;&#1076;&#1082;&#1072; &#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1074; <span class="emphasis"><em>&#1101;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1080;</em></span> &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;.
					</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3>
						&#1069;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1103; &#8212; &#1084;&#1077;&#1088;&#1072; &#1093;&#1072;&#1086;&#1089;&#1072;, &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;&#1080;, &#1085;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1063;&#1090;&#1086;-&#1073;&#1099; "&#1086;&#1088;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1089;&#1103;", &#1090;.&#1077;.
						&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1085;&#1072;&#1084; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1091;&#1073;&#1088;&#1072;&#1090;&#1100; &#1085;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1050; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091; &#1101;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1103; &#1084;&#1086;&#1085;&#1077;&#1090;&#1082;&#1080;
						(&#1090;&#1086;&#1095;&#1085;&#1077;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1073;&#1088;&#1072;&#1089;&#1082;&#1072; &#1080;&#1076;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1084;&#1086;&#1085;&#1077;&#1090;&#1082;&#1080; &#1074; &#1089;&#1092;&#1077;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1074;&#1072;&#1082;&#1091;&#1091;&#1084;&#1077;) &#1088;&#1072;&#1074;&#1085;&#1072; &#1088;&#1086;&#1074;&#1085;&#1086; 1 &#1073;&#1080;&#1090;&#1091;. &#1063;&#1090;&#1086;-&#1073;&#1099;
						&#1091;&#1079;&#1085;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1086;&#1081; &#1091;&#1087;&#1072;&#1083;&#1072; &#1084;&#1086;&#1085;&#1077;&#1090;&#1082;&#1072;, &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; <span class="emphasis"><em>&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;</em></span> &#1101;&#1090;&#1086;&#1090; &#1073;&#1080;&#1090;.
						&#1050;&#1083;&#1086;&#1076; &#1064;&#1077;&#1085;&#1086;&#1085; &#1076;&#1072;&#1074;&#1085;&#1086; &#1091;&#1078;&#1077; &#1074;&#1099;&#1074;&#1077;&#1083; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1091; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1101;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1080; &#1083;&#1102;&#1073;&#1099;&#1093; "&#1084;&#1086;&#1085;&#1077;&#1090;&#1086;&#1082;":
						<p>&#9317;</p><pre class="programlisting">
								E = -p*log&#8322;(p)
						</pre>
						&#1047;&#1076;&#1077;&#1089;&#1100; «p» &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; <span class="emphasis"><em>&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;</em></span> &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1080; &#1077;&#1089;&#1083;&#1080; &#1084;&#1099; &#1093;&#1086;&#1090;&#1080;&#1084;
						&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1101;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1102; &#1074; &#1073;&#1080;&#1090;&#1072;&#1093;, &#1090;&#1086; &#1083;&#1086;&#1075;&#1072;&#1088;&#1080;&#1092;&#1084; &#1085;&#1072;&#1076;&#1086; &#1073;&#1088;&#1072;&#1090;&#1100; &#1087;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1102; 2.
					</div><p>
				</p><p>
					&#1063;&#1090;&#1086;-&#1073;&#1099; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100; &#1101;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1102; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1101;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1080; &#1074;&#1089;&#1077;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1080;&#1079; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072;.
					&#1050; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1091; &#1085;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100; 65536 &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099;&#1093; &#1080; &#1088;&#1072;&#1074;&#1085;&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1099;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;, &#1090;&#1086; &#1101;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1074;&#1085;&#1086;&#1081;:
					65536*(-1/65536*log&#8322;(1/65536))=16&#1073;&#1080;&#1090;. &#1058;.&#1077;. &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1088;&#1077;&#1094;&#1080;&#1087;&#1080;&#1077;&#1085;&#1090;&#1091; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1076;&#1086;&#1085;&#1086;&#1088;&#1091;
					&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1087;&#1086;&#1089;&#1083;&#1072;&#1090;&#1100; &#1088;&#1086;&#1074;&#1085;&#1086; 16&#1073;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1091;&#1076;&#1080;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1090;.&#1082;. &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;
					&#1089;&#1086;&#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1089; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084; &#1086;&#1090; 0 &#1076;&#1086; 2¹&#8310;-1.
				</p><p>
					&#1055;&#1088;&#1080; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1076;&#1074;&#1091;&#1093; &#1095;&#1080;&#1089;&#1077;&#1083; {0..255} (&#1079;&#1076;&#1077;&#1089;&#1100; &#1080; &#1076;&#1072;&#1083;&#1077;&#1077; &#1101;&#1090;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;: &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 255 &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;) &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1086;
					{0..65025}, &#1090;.&#1077;. &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; {0..65536} (&#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;, &#1087;&#1088;&#1080; &#1089;&#1090;&#1088;&#1077;&#1084;&#1083;&#1077;&#1085;&#1080;&#1080; &#1084;&#1085;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081; &#1082; &#1073;&#1077;&#1089;&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1084;&#1086;&#1097;&#1085;&#1086;&#1089;&#1090;&#1100;
					&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1081; &#1089;&#1090;&#1088;&#1077;&#1084;&#1080;&#1090;&#1089;&#1103; &#1082; &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1091; &#1084;&#1086;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;). &#1048; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1074;&#1079;&#1075;&#1083;&#1103;&#1076; &#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1095;&#1090;&#1080; 16&#1073;&#1080;&#1090;
					&#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;. &#1053;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1103; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1091; &#1064;&#1077;&#1085;&#1085;&#1086;&#1085;&#1072; &#1084;&#1099; &#1074;&#1080;&#1076;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1101;&#1085;&#1090;&#1088;&#1086;&#1087;&#1080;&#1103; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; &#1088;&#1072;&#1074;&#1085;&#1072; 13.705&#1073;&#1080;&#1090;, &#1072; &#1085;&#1077; 16&#1073;&#1080;&#1090;.
					&#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1081; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; 65536, &#1072; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; 17578 (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; &#1085;&#1072;&#1096;&#1077;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;
					&#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1095;&#1080;&#1089;&#1083;&#1086; 257). &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1095;&#1072;&#1097;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;, &#1090;.&#1077;. &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1081;
					&#1088;&#1072;&#1079;&#1085;&#1072;&#1103;.
				</p><p>
					&#1058;.&#1077;. &#1084;&#1099; &#1074;&#1080;&#1076;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084; &#1073;&#1080;&#1090;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1074; &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;.
					&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; "&#1084;&#1086;&#1078;&#1085;&#1086;" &#1074;&#1086;&#1074;&#1089;&#1077; &#1085;&#1077; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; "&#1083;&#1077;&#1075;&#1082;&#1086; &#1080; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;". &#1057;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1089;&#1078;&#1072;&#1090;&#1080;&#1103; &#1085;&#1072; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1080; &#1087;&#1088;&#1077;&#1074;&#1086;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090;
					&#1089;&#1090;&#1086;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050; &#1090;&#1086;&#1084;&#1091; &#1078;&#1077;, &#1101;&#1090;&#1080; &#1089;&#1078;&#1072;&#1090;&#1099;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1091;&#1078;&#1077; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1089;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1090;&#1100;/&#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;.
				</p><p>
					&#1042;&#1090;&#1086;&#1088;&#1072;&#1103; &#1073;&#1077;&#1076;&#1072; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#8212; &#1101;&#1090;&#1086; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1074; &#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
				</p><p>
					&#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1083;&#1102;&#1073;&#1086; &#1095;&#1080;&#1089;&#1083;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1084;&#1085;&#1086;&#1078;&#1080;&#1090;&#1100;, &#1085;&#1086; &#1085;&#1077; &#1083;&#1102;&#1073;&#1086;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1086;&#1089;&#1090;&#1072;&#1074;&#1072;&#1103;&#1089;&#1100; &#1074; &#1082;&#1086;&#1083;&#1100;&#1094;&#1077;. &#1044;&#1072;&#1078;&#1077;
					&#1074; &#1089;&#1072;&#1084;&#1086;&#1084; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1082;&#1086;&#1083;&#1100;&#1094;&#1072;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1082;&#1072;&#1082; ½, &#1080;&#1083;&#1080; ¾ &#1085;&#1077;&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1080;&#1084;&#1099;.
				</p></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489145152"></a>&#1056;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072;</h4></div></div></div><p>
					&#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072; &#1094;&#1077;&#1083;&#1099;&#1093;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;. &#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;,
					&#1087;&#1086;&#1095;&#1077;&#1084;&#1091; &#1085;&#1077;&#1090;? &#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;: no way. &#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080; &#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;, &#1084;&#1099; &#1083;&#1080;&#1096;&#1072;&#1077;&#1084;&#1089;&#1103; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;/&#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1085;&#1080;&#1103;,
					&#1090;&#1086;&#1095;&#1085;&#1077;&#1077; &#1101;&#1090;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1103;&#1090;&#1100;&#1089;&#1103; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1076;&#1086;&#1088;&#1086;&#1075;&#1080;: &#1083;&#1080;&#1073;&#1086; &#1084;&#1099; &#1101;&#1082;&#1089;&#1087;&#1086;&#1085;&#1077;&#1085;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1084; &#1080;&#1093; &#1089;&#1083;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;
					(&#1090;.&#1077;. &#1085;&#1072;&#1089; &#1087;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090; &#1090;&#1072; &#1078;&#1077; &#1073;&#1077;&#1076;&#1072;, &#1095;&#1090;&#1086; &#1089; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1082;&#1086;&#1083;&#1100;&#1094;&#1077; &#1094;&#1077;&#1083;&#1099;&#1093;), &#1083;&#1080;&#1073;&#1086;
					&#1084;&#1099; &#1074;&#1099;&#1085;&#1091;&#1078;&#1076;&#1072;&#1077;&#1084; &#1089;&#1077;&#1073;&#1103; &#1092;&#1072;&#1082;&#1090;&#1086;&#1088;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077; &#1076;&#1086;&#1088;&#1086;&#1075;&#1086;.
				</p></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="idm139835489142400"></a>&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1077; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072;: &#1082;&#1086;&#1083;&#1100;&#1094;&#1072; &#1074;&#1099;&#1095;&#1077;&#1090;&#1086;&#1074; &#1080; &#1087;&#1086;&#1083;&#1103; &#1043;&#1072;&#1083;&#1091;&#1072;</h3></div></div></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489141792"></a>&#1047;&#1072;&#1095;&#1077;&#1084;?</h4></div></div></div><p>
					&#1055;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1086;&#1090; &#1073;&#1077;&#1089;&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1093; &#1082; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1084; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072;&#1084; &#1076;&#1080;&#1082;&#1090;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1091;&#1088;&#1086;&#1074;&#1086;&#1081; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;: &#1091; &#1085;&#1072;&#1089; &#1090;&#1091;&#1087;&#1086; &#1085;&#1077;&#1090; &#1101;&#1090;&#1080;&#1093;
					&#1074;&#1072;&#1096;&#1080;&#1093; &#1073;&#1077;&#1089;&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1093; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;, &#1101;&#1090;&#1086; &#1074;&#1089;&#1077;&#1075;&#1086;-&#1083;&#1080;&#1096;&#1100; &#1093;&#1080;&#1084;&#1077;&#1088;&#1072;, &#1087;&#1088;&#1080;&#1076;&#1091;&#1084;&#1072;&#1085;&#1085;&#1072;&#1103; &#1085;&#1072;&#1084;&#1080; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1090;&#1099; &#1088;&#1072;&#1089;&#1089;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081;.
				</p></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489140144"></a>&#1050;&#1086;&#1083;&#1100;&#1094;&#1086; &#1074;&#1099;&#1095;&#1077;&#1090;&#1086;&#1074;</h4></div></div></div><p>
					&#1042;&#1087;&#1086;&#1083;&#1085;&#1077; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1091; &#1085;&#1072;&#1089; &#1074;&#1089;&#1077;&#1075;&#1086; 4 &#1073;&#1080;&#1090;&#1072;, &#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072;
					1111&#8322; &#1080;&#1076;&#1105;&#1090; &#1095;&#1080;&#1089;&#1083;&#1086; 0000&#8322;. &#1069;&#1090;&#1086; &#1093;&#1086;&#1088;&#1086;&#1096;&#1080;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088;, &#1074;&#1077;&#1076;&#1100; &#1077;&#1089;&#1083;&#1080; "&#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;", &#1090;&#1086;
					&#1085;&#1072;&#1096;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072; &#1074;&#1077;&#1076;&#1091;&#1090; &#1089;&#1077;&#1073;&#1103; &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077;, &#1094;&#1077;&#1083;&#1099;&#1077;, &#1074;&#1086; &#1074;&#1089;&#1103;&#1082;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1080; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;. &#1044;&#1072; &#1080; &#1089;&#1072;&#1084;&#1072;
					"&#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;" &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1072;: &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1086;&#1089;&#1083;&#1077; 23 &#1095;&#1072;&#1089;&#1086;&#1074; &#1080;&#1076;&#1105;&#1090; &#1085;&#1077; 24, &#1072; 00 &#1095;&#1072;&#1089;&#1086;&#1074;.
				</p><p>
					&#1044;&#1072; &#1080; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077;, &#1101;&#1090;&#1080; <span class="emphasis"><em>&#1074;&#1099;&#1095;&#1077;&#1090;&#1099;</em></span> &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1095;&#1091;&#1090;&#1100;-&#1083;&#1080; &#1085;&#1077; &#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1096;&#1072;&#1075;&#1091;.
				</p><p>
					&#1055;&#1077;&#1088;&#1074;&#1072;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1087;&#1086;&#1076;&#1082;&#1088;&#1072;&#1076;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1085;&#1086;: &#1084;&#1099; &#1090;&#1077;&#1088;&#1103;&#1077;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <span class="emphasis"><em>&#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;</em></span>
					&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072;. &#1058;.&#1077;. &#1079;&#1085;&#1072;&#1095;&#1082;&#1080; "&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;" &#1080; "&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;" &#1091;&#1078;&#1077; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090;: 1111&#8322; "&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;" 1110&#8322;, &#1072; 0000&#8322; "&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;" 1111&#8322;.
					&#1057; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, 0000&#8322; "&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;" 1111&#8322;&#8230;
				</p><p>
					&#1042;&#1089;&#1077;&#1075;&#1076;&#1072; &#1085;&#1072;&#1076;&#1086; &#1089;&#1083;&#1077;&#1076;&#1080;&#1090;&#1100;, &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1096;&#1083;&#1080;-&#1083;&#1080; &#1084;&#1099; "&#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;"?
				</p><p>
					&#1042;&#1087;&#1088;&#1086;&#1095;&#1077;&#1084;, &#1101;&#1090;&#1072; &#1090;&#1086;&#1095;&#1082;&#1072; &#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1082;&#1086;&#1083;&#1100;&#1094;&#1077; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1072;, &#1080; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1088;&#1077;&#1096;&#1072;&#1077;&#1084;&#1072;.
					</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3>
						&#1062;&#1077;&#1085;&#1072; &#1087;&#1088;&#1072;&#1074;&#1076;&#1072; &#1074;&#1077;&#1083;&#1080;&#1082;&#1072;: &#1076;&#1083;&#1103; &#1095;&#1080;&#1089;&#1077;&#1083; {0..255} &#1089;&#1087;&#1083;&#1086;&#1096;&#1100; &#1080; &#1088;&#1103;&#1076;&#1086;&#1084; &#1075;&#1086;&#1085;&#1103;&#1102;&#1090; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086; {-2147483648..2147483648}, &#1077;&#1089;&#1083;&#1080;
						&#1085;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;. &#1053;&#1091; &#1076;&#1072; &#1083;&#1072;&#1076;&#1085;&#1086;, &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1099; &#1091; &#1085;&#1072;&#1089; &#1073;&#1099;&#1089;&#1090;&#1088;&#1099;&#1077;.
					</div><p>
				</p><p>
					&#1042;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1089;&#1077;&#1088;&#1100;&#1105;&#1079;&#1085;&#1077;&#1077;: &#1074;&#1099;&#1095;&#1077;&#1090;&#1099; &#1083;&#1080;&#1096;&#1072;&#1102;&#1090; &#1085;&#1072;&#1089; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1058;&#1086;&#1095;&#1085;&#1077;&#1077;, &#1090;&#1086; "&#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;", &#1095;&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074; &#1074;&#1099;&#1095;&#1077;&#1090;&#1072;&#1093;,
					&#1087;&#1086;&#1095;&#1090;&#1080; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1073;&#1077;&#1089;&#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1080; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; &#1089; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1084; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1059;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1094;&#1077;&#1083;&#1099;&#1093; &#1074; 32 &#1073;&#1080;&#1090;&#1072;
					&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1082;&#1072;&#1082; &#1085;&#1072;&#1076;&#1086; &#1083;&#1080;&#1096;&#1100; &#1085;&#1072; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1086;&#1084; &#1082;&#1091;&#1089;&#1086;&#1095;&#1082;&#1077; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1084;&#1085;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1080; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1099; {0..65536}, &#1095;&#1090;&#1086; &#1085;&#1072;
					&#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1095;&#1091;&#1090;&#1100; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1085;&#1080;&#1095;&#1090;&#1086;.
				</p><p>
					"&#1041;&#1083;&#1072;&#1075;&#1086;&#1076;&#1086;&#1088;&#1103;" &#1101;&#1090;&#1086;&#1084;&#1091;, &#1074;&#1089;&#1103; &#1072;&#1088;&#1080;&#1092;&#1084;&#1077;&#1090;&#1080;&#1082;&#1072; &#1074; &#1094;&#1077;&#1083;&#1099;&#1093; &#1085;&#1072; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1072; &#1090;&#1088;&#1080;&#1074;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1076;&#1077;&#1089;&#1090;&#1074;&#1080;&#1103;&#1084;&#1080;, &#1074;&#1088;&#1086;&#1076;&#1077; "&#1076;&#1086;&#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1086;&#1090; 1 &#1076;&#1086; 100",
					&#1080;&#1083;&#1080; &#1090;&#1080;&#1087;&#1072; &#1090;&#1086;&#1075;&#1086;&#8230;
				</p><p>
					&#1044;&#1083;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1081; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1083;&#1072;&#1074;&#1091;&#1102;&#1097;&#1072;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072;, &#1085;&#1086; &#1080; &#1086;&#1085;&#1072; &#1085;&#1077; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1075;&#1086;&#1076;&#1085;&#1072; &#1080;&#1079;-&#1079;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077;&#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1077;&#1084;&#1086;&#1089;&#1090;&#1080;.
				</p><p>
					&#1055;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; "&#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;", &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1091; &#1085;&#1072;&#1089; &#1077;&#1089;&#1090;&#1100;, &#1086;&#1073;&#1088;&#1077;&#1095;&#1077;&#1085;&#1072; &#1085;&#1072; &#1087;&#1088;&#1086;&#1074;&#1072;&#1083; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086; &#8212; &#1085;&#1077; &#1087;&#1086;&#1083;&#1077;.
					&#1050; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091; &#1074; &#1082;&#1086;&#1083;&#1100;&#1094;&#1077; Z&#8321;&#8322; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; 3*4=0; 6*2=0, &#1090;.&#1077;. &#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; "&#1087;&#1086;&#1083;&#1103;" &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1085;&#1103;&#1096;&#1085;&#1099;&#1077;
					<span class="emphasis"><em>&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1080; &#1085;&#1091;&#1083;&#1103;</em></span>. &#1048;&#1093; &#1085;&#1103;&#1096;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1086;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090;
					&#1085;&#1086;&#1083;&#1100; &#1085;&#1072; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077;: &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1086;&#1074;&#1089;&#1077; &#1085;&#1077; &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086; &#1088;&#1072;&#1074;&#1077;&#1085; &#1085;&#1091;&#1083;&#1102;, &#1082;&#1072;&#1082; &#1074; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1095;&#1080;&#1089;&#1083;&#1072;&#1093;.
				</p></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489128400"></a>&#1055;&#1086;&#1083;&#1103; &#1043;&#1072;&#1083;&#1091;&#1072;</h4></div></div></div><p>
					&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1091;&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1084;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1079;&#1103;&#1090;&#1100; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086; &#1074;&#1099;&#1095;&#1077;&#1090;&#1086;&#1074; &#1089; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1084;&#1091; &#1095;&#1080;&#1089;&#1083;&#1091;, &#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091; Z&#8327;.
					&#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1077;&#1084;, &#1080; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;. &#1058;.&#1077;. &#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081;
					&#1085;&#1091;&#1083;&#1103; &#1085;&#1077; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;(&#1082;&#1088;&#1086;&#1084;&#1077; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1085;&#1091;&#1083;&#1103; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;). &#1057;&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1084; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; GF&#8327;:
					</p><p>&#9318;</p><pre class="programlisting">
							0 0 0 0 0 0 0
							0 1 2 3 4 5 6
							0 2 4 6 1 3 5
							0 3 6 2 5 1 4
							0 4 1 5 2 6 3
							0 5 3 1 6 4 2
							0 6 5 4 3 2 1
					</pre><p>
					&#1042;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093;, &#1087;&#1088;&#1103;&#1084;&#1086; &#1080;&#1079; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1074;&#1080;&#1076;&#1085;&#1072; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;: &#1074;&#1089;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077;(&#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1077;,
					&#1082;&#1088;&#1086;&#1084;&#1077; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1085;&#1091;&#1083;&#1103;) &#1088;&#1072;&#1079;&#1085;&#1099;&#1077;. &#1048;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1080; &#1080; &#1084;&#1085;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084;
					&#1085;&#1072;&#1081;&#1090;&#1080; &#1084;&#1085;&#1086;&#1078;&#1080;&#1084;&#1086;&#1077;. &#1058;.&#1086;. &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; <span class="emphasis"><em>&#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1077;</em></span> &#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;(&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;
					&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1085;&#1086;&#1083;&#1100;. &#1044;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1085;&#1086;&#1083;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; "&#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;" &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1090;&#1088;&#1072;&#1082;&#1090;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; "&#1086;&#1076;&#1085;&#1086; &#1083;&#1102;&#1073;&#1086;&#1077; &#1080;&#1079; &#1095;&#1080;&#1089;&#1077;&#1083;
					Z&#8327; &#1074;&#1079;&#1103;&#1090;&#1086;&#1077; &#1089; &#1088;&#1072;&#1074;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;". &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1072; &#1086;&#1090; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; "&#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;" &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;(&#1085;&#1086; &#1085;&#1077; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072;!)
					&#1089;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;).
				</p><p>
					&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1074; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1074;&#1086;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1074; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103;:
					</p><p>&#9319;</p><pre class="programlisting">
							  n| 1 2 3 4 5 6
							  &#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;&#8212;
							1^n| 1 1 1 1 1 1
							2^n| 2 4 1 2 4 1
							3^n| 3 2 6 4 5 1
							4^n| 4 2 1 4 2 1
							5^n| 5 4 6 2 3 1
							6^n| 6 1 6 1 6 1
					</pre><p>
					&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1077;&#1085; &#1074; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1084; 3^n &#1080; 5^n, &#1090;.&#1082;. &#1074;&#1089;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1074; &#1101;&#1090;&#1080;&#1093; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;&#1093; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077;. &#1047;&#1085;&#1072;&#1095;&#1080;&#1090;,
					&#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1087;&#1086;&#1083;&#1077; &#1089; &#1101;&#1090;&#1080;&#1084;&#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1077; &#1074;&#1086;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100;,
					&#1085;&#1086; &#1080; &#1086;&#1076;&#1085;&#1086;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1077; &#1083;&#1086;&#1075;&#1072;&#1088;&#1080;&#1092;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;. &#1058;&#1072;&#1082;&#1080;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; <span class="emphasis"><em>&#1087;&#1077;&#1088;&#1074;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1085;&#1099;&#1084;&#1080;</em></span>.
				</p><p>
					&#1042; &#1089;&#1090;&#1072;&#1088;&#1080;&#1085;&#1091; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1080;: "&#1083;&#1086;&#1075;&#1086;&#1088;&#1080;&#1092;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1091;&#1076;&#1083;&#1080;&#1085;&#1085;&#1103;&#1077;&#1090; &#1078;&#1080;&#1079;&#1085;&#1100; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1082;&#1086;&#1074;", &#1089;&#1077;&#1081;&#1095;&#1072;&#1089; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;,
					&#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1078;&#1077; &#1091;&#1089;&#1082;&#1086;&#1088;&#1103;&#1077;&#1090; &#1085;&#1072;&#1096;&#1080; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1099;: &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1083;&#1086;&#1075;&#1072;&#1088;&#1080;&#1092;&#1084;&#1086;&#1074;
					(&#1091; &#1085;&#1072;&#1089; &#1074; &#1085;&#1077;&#1081; &#1074;&#1089;&#1077;&#1075;&#1086; 6 &#1095;&#1080;&#1089;&#1077;&#1083;), &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1074;&#1077;&#1089;&#1090;&#1080; &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;/&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1102;/&#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1085;&#1080;&#1102;.
				</p><p>
					&#1050; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, &#1074;&#1079;&#1103;&#1074; &#1087;&#1086; &#1090;&#1088;&#1072;&#1076;&#1080;&#1094;&#1080;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1075;&#1086;&#1076;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1080;&#1079; &#9319;, &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084;
					log&#8325;(6*6)=log&#8325;6+log&#8325;6=3+3=6, &#1086;&#1090;&#1082;&#1091;&#1076;&#1072; 6*6=5^6=1.
				</p><p>
					&#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: log&#8325;(2/3)=log&#8325;2-log&#8325;3=4-5=-1=-1+6=5, &#1086;&#1090;&#1082;&#1091;&#1076;&#1072; 2/3=5^5=3. &#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1084;&#1099; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;
					-1 &#1074; &#1085;&#1072;&#1096;&#1077; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1080;&#1073;&#1072;&#1074;&#1083;&#1103;&#1103; 6 (&#1072; &#1085;&#1077; &#1085;&#1072;&#1096; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; 7) &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1083;&#1086;&#1075;&#1072;&#1088;&#1080;&#1092;&#1084;&#1086;&#1074; &#1053;&#1045; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; log&#8325;0,
					&#1080; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1085;&#1072; 1 &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; 7.
					</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3>
						&#1044;&#1077;&#1083;&#1086; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1080;, &#1074;&#1086;&#1079;&#1074;&#1086;&#1076;&#1103; &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1084; 0. &#1055;&#1086;&#1090;&#1086;&#1084;&#1091; log&#8325;0 &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;.
						&#1055;&#1088;&#1080; &#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080;, &#1084;&#1099; &#1074;&#1099;&#1095;&#1080;&#1090;&#1072;&#1077;&#1084; &#1083;&#1086;&#1075;&#1072;&#1088;&#1080;&#1092;&#1084;&#1099;, &#1090;.&#1077;. &#1076;&#1074;&#1080;&#1078;&#1077;&#1084;&#1089;&#1103; &#1074;&#1083;&#1077;&#1074;&#1086; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; &#1083;&#1086;&#1075;&#1072;&#1088;&#1080;&#1092;&#1084;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1083;&#1072;&#1089;&#1100;
						(&#1083;&#1077;&#1074;&#1077;&#1077; log&#8325;1), &#1090;&#1086; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1077;&#1088;&#1077;&#1087;&#1088;&#1099;&#1075;&#1085;&#1091;&#1090;&#1100; log&#8325;0, &#1085;&#1072; log&#8325;6.
					</div><p>
				</p></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489117168"></a>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1076;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1076; &#1087;&#1086;&#1083;&#1077;&#1084; &#1043;&#1072;&#1083;&#1091;&#1072; GF&#8327;</h4></div></div></div><p>
					&#1042;&#1099;&#1073;&#1077;&#1088;&#1077;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1091;&#1102; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1091; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:
					</p><p>&#9320;</p><pre class="programlisting">
							|1 2|
							|1 3|
							|1 4|
					</pre><p>
					&#1058;&#1072;&#1082;&#1078;&#1077; &#1074;&#1099;&#1073;&#1077;&#1088;&#1077;&#1084; d&#8320;=3 &#1080; d&#8321;=4.
				</p><p>
					&#1058;&#1086;&#1075;&#1076;&#1072; &#1079;&#1072;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1090;&#1088;&#1077;&#1084;&#1103; &#1091;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;:
					</p><pre class="programlisting">
							1*d&#8320; + 2*d&#8321; = c&#8320; = 1*3 + 2*4 = 4
							1*d&#8320; + 3*d&#8321; = c&#8321; = 1*3 + 3*4 = 1
							1*d&#8320; + 4*d&#8321; = c&#8322; = 1*3 + 4*4 = 5
					</pre><p>
					&#1058;&#1091;&#1090; &#1085;&#1072;&#1084; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1076;&#1083;&#1103; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; 2*3 &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1080; 3 &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;.
				</p><p>
					&#1058;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1076;&#1086; &#1088;&#1077;&#1094;&#1080;&#1087;&#1080;&#1077;&#1085;&#1090;&#1072; &#1076;&#1086;&#1096;&#1083;&#1080; &#1083;&#1080;&#1096;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080; c&#8321; &#1080; c&#8322;.
				</p><p>
					&#1041;&#1086;&#1083;&#1100;&#1096;&#1077; &#1074;&#1089;&#1077;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1099;. &#1053;&#1086; &#1101;&#1090;&#1080; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1074;&#1083;&#1080;&#1103;&#1102;&#1090; &#1085;&#1072; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100;,
					&#1090;.&#1082;. &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1080;&#1093; &#1085;&#1072;&#1076;&#1086; &#1083;&#1080;&#1096;&#1100; 1 &#1088;&#1072;&#1079; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;(&#1074; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1099;&#1089;&#1103;&#1095;&#1080; &#1080; &#1076;&#1077;&#1089;&#1103;&#1090;&#1082;&#1080; &#1090;&#1099;&#1089;&#1103;&#1095;
					&#1095;&#1080;&#1089;&#1077;&#1083;). &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1084; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1091;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102; &#1080;&#1079; &#9320; &#1074;&#1099;&#1095;&#1105;&#1088;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;:
					</p><pre class="programlisting">
							|1 3| |1 0|
							|1 4| |0 1| -

							|1 3| |1 0|
							|0 1| |6 1| ×3

							|1 3| |1 0| -
							|0 3| |4 3|

							|1 0| |4 4|
							|0 3| |4 3| ×5 (&#1090;&#1086;&#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1080; ×&#8531;)

							|1 0| |4 4|
							|0 1| |6 1|.
					</pre><p>
					&#1047;&#1085;&#1072;&#1103; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1091;&#1102; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1091;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;:
					</p><pre class="programlisting">
							d&#8320; = 4*c&#8321; + 4*c&#8322; = 4*1+4*5 = 3
							d&#8321; = 6*c&#8321; + 1*c&#8322; = 6*1+1*5 = 4
					</pre><p>
					&#1044;&#1083;&#1103; &#1076;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1085;&#1086;&#1074;&#1100; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; 2*3 &#1091;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1080; 3 &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1072;&#1082; &#1080; &#1087;&#1088;&#1080; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;. &#1058;.&#1086;. &#1084;&#1099; &#1074;&#1080;&#1076;&#1080;&#1084;,
					&#1095;&#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1076;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090;, &#1080; &#1085;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1074;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
				</p><p>
					&#1045;&#1089;&#1083;&#1080;-&#1073;&#1099; &#1088;&#1077;&#1094;&#1080;&#1087;&#1080;&#1077;&#1085;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;-&#1073;&#1099; &#1073;&#1083;&#1086;&#1082;&#1080; c&#8320; &#1080; c&#8321; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086;-&#1073;&#1099; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1091;
					</p><pre class="programlisting">
							|1 2| &#8594; |3 5|
							|1 3|   |6 1|
					</pre><p>
					&#1053;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;-&#1073;&#1099; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1089;&#1103;:
					</p><pre class="programlisting">
							d&#8320; = 3*c&#8320; + 5*c&#8321; = 3*4+5*1 = 3
							d&#8321; = 6*c&#8320; + 1*c&#8321; = 6*4+1*1 = 4
					</pre><p>
				</p></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="no_recover"></a>&#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;&#1084; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;</h4></div></div></div><p>
					&#1054;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1089;&#1090;&#1091;&#1087;&#1080;&#1074;&#1096;&#1080;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;, &#1090;&#1086; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;. &#1052;&#1072;&#1083;&#1086; &#1090;&#1086;&#1075;&#1086;,
					&#1084;&#1099; &#1076;&#1072;&#1078;&#1077; <span class="emphasis"><em>&#1085;&#1077; &#1089;&#1084;&#1086;&#1078;&#1077;&#1084; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1086;&#1076;&#1080;&#1085; &#1073;&#1083;&#1086;&#1082;</em></span>.
				</p><p>
					&#1044;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;, &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1076;&#1105;&#1090; &#1087;&#1088;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1083;&#1080;&#1096;&#1100; &#1073;&#1083;&#1086;&#1082;&#1072; c&#8321;=1. &#1055;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1077;&#1084; &#1091;&#1075;&#1072;&#1076;&#1072;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082; c&#8320;
					</p><pre class="programlisting">
							c0=0, d0=5, d1=1
							c0=1, d0=1, d1=0
							c0=2, d0=4, d1=6
							c0=3, d0=0, d1=5
							c0=4, d0=3, d1=4
							c0=5, d0=6, d1=3
							c0=6, d0=2, d1=2
					</pre><p>
					&#1052;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1083;&#1080; 7 &#1088;&#1072;&#1074;&#1085;&#1086;&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088; (d&#8320;,d&#8321;). &#1055;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1091;&#1075;&#1072;&#1076;&#1072;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082; c&#8322; &#1076;&#1072;&#1089;&#1090; &#1090;&#1077; &#1078;&#1077; &#1087;&#1072;&#1088;&#1099;
					</p><pre class="programlisting">
							c2=0, d0=4, d1=6
							c2=1, d0=1, d1=0
							c2=2, d0=5, d1=1
							c2=3, d0=2, d1=2
							c2=4, d0=6, d1=3
							c2=5, d0=3, d1=4
							c2=6, d0=0, d1=5
					</pre><p>
					&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;.
				</p><p>
					&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1079;&#1085;&#1072;&#1090;&#1100; &#1083;&#1080;&#1096;&#1100; &#1086;&#1076;&#1080;&#1085; &#1073;&#1083;&#1086;&#1082; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093;, &#1090;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1076;&#1072;&#1078;&#1077;
					&#1086;&#1076;&#1080;&#1085; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1073;&#1083;&#1086;&#1082;, &#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 7 &#1088;&#1072;&#1074;&#1085;&#1086;&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;.
				</p></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489098896"></a>&#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1099; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1074;&#1099;&#1073;&#1086;&#1088; GF</h4></div></div></div><p>
					&#1053;&#1072;&#1076; &#1101;&#1090;&#1080;&#1084; &#1087;&#1086;&#1083;&#1077;&#1084;(GF&#8327;) &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1083;&#1080;&#1096;&#1100; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; 150%. &#1069;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1076;&#1083;&#1103; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077;.
					&#1053;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; GF &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; 1399, &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1099; 15×7(&#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; 214%, 200%, 186%,
					171%, 157%, 143%, 129%, &#1080; 114%), &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1076;&#1083;&#1103; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; 157% &#1088;&#1077;&#1094;&#1080;&#1087;&#1080;&#1077;&#1085;&#1090;&#1091; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; 15 &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;, &#1072; &#1074;&#1089;&#1077;&#1075;&#1086; 11.
					&#1044;&#1083;&#1103; &#1077;&#1097;&#1105; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1075;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1073;&#1077;&#1088;&#1105;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077; 7, &#1072; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1074;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;, &#1090;.&#1086;. &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;
					300% &#1080; &#1073;&#1086;&#1083;&#1077;&#1077;.
				</p></div><div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="idm139835489096128"></a>&#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103; &#1043;&#1072;&#1083;&#1091;&#1072;</h4></div></div></div><p>
					&#1042; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1076;&#1077;&#1082;&#1086;&#1076;&#1077;&#1088;&#1072;&#1093;(e.g. &#1082;&#1086;&#1076; &#1056;&#1080;&#1076;&#1072;-&#1057;&#1086;&#1083;&#1086;&#1084;&#1086;&#1085;&#1072;) &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1103; &#1043;&#1072;&#1083;&#1091;&#1072; &#1089; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1085;&#1099;&#1084;(&#1072; &#1085;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084;, &#1082;&#1072;&#1082; &#1091; &#1084;&#1077;&#1085;&#1103;)
					&#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084;. &#1058;&#1072;&#1082;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1076;&#1083;&#1103; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; &#1074;&#1080;&#1076;&#1072; p^q, &#1075;&#1076;&#1077; p &#8212; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086;, &#1072; q &#8212; &#1083;&#1102;&#1073;&#1086;&#1077; &#1094;&#1077;&#1083;&#1086;&#1077;
					&#1073;&#1086;&#1083;&#1100;&#1096;&#1077; 1(&#1087;&#1088;&#1080; q=1 &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1096;&#1077;&#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1086;&#1077; GF &#1089; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084;).
				</p><p>
					&#1069;&#1090;&#1086;&#1090; &#1074;&#1099;&#1073;&#1086;&#1088; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1083;&#1102;&#1089;, &#1090;.&#1082;. &#1082;&#1086;&#1076;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1087;&#1088;&#1103;&#1084;&#1086; &#1085;&#1072;&#1076; &#1084;&#1072;&#1096;&#1080;&#1085;&#1085;&#1099;&#1084;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;&#1080; &#1089; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1084; 2^q.
				</p><p>
					&#1059;&#1084;&#1085;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1090;&#1072;&#1082;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1091;&#1090;&#1105;&#1084; &#1083;&#1086;&#1075;&#1072;&#1088;&#1080;&#1092;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1080; &#1087;&#1086;&#1090;&#1077;&#1085;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1053;&#1086; &#1074;&#1086;&#1090; &#1089;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;
					&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1087;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1102; p=2. &#1048;&#1052;&#1061;&#1054; &#1101;&#1090;&#1086; &#1085;&#1077; &#1089;&#1072;&#1084;&#1099;&#1081; &#1083;&#1091;&#1095;&#1096;&#1080;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088;, &#1090;.&#1082;. &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; XOR &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1087;&#1083;&#1086;&#1093;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1096;&#1080;&#1074;&#1072;&#1077;&#1090;
					&#1073;&#1080;&#1090;&#1099;. &#1055;&#1086; &#1084;&#1086;&#1077;&#1084;&#1091; &#1084;&#1085;&#1077;&#1085;&#1080;&#1102; &#1077;&#1089;&#1090;&#1100; &#1089;&#1084;&#1099;&#1089;&#1083; &#1087;&#1077;&#1088;&#1077;&#1081;&#1090;&#1080; &#1082; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;, &#1080; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1090;&#1072;&#1084;. &#1069;&#1090;&#1086; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1076;&#1086;&#1088;&#1086;&#1078;&#1077;,
					&#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1099; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077; &#1089;&#1095;&#1080;&#1090;&#1072;&#1102;&#1090;, &#1085;&#1077;&#1078;&#1077;&#1083;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;, &#1072; &#1091;&#1078; &#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1102;&#1090;
					&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1087;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1082;&#1072;&#1085;&#1072;&#1083;&#1072;&#1084;.
				</p></div></div><div class="section"><div class="titlepage"></div><p>
				<a class="link" href="chapter2.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;">&#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;</a> &#8594;
			</p></div></div></body></html>
