<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="zz"><link rel="up" href="index.html" title="zz"><link rel="prev" href="chapter2.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;"><link rel="next" href="ch03s02.html" title="&#1061;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="chapter3"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</h1></div></div></div><div class="toc"><p><b>&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</b></p><dl class="toc"><dt><span class="section"><a href="chapter3.html#idm139835488964272">&#1053;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</a></span></dt><dd><dl><dt><span class="section"><a href="chapter3.html#idm139835488963760"></a></span></dt></dl></dd><dt><span class="section"><a href="ch03s02.html">&#1061;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</a></span></dt><dd><dl><dt><span class="section"><a href="ch03s02.html#idm139835488927920">&#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;</a></span></dt><dt><span class="section"><a href="ch03s02.html#idm139835488924608">&#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;</a></span></dt><dt><span class="section"><a href="ch03s02.html#idm139835488915760">&#1050;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</a></span></dt></dl></dd><dt><span class="section"><a href="ch03s03.html">&#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086; &#1057;&#1077;&#1090;&#1080;</a></span></dt><dd><dl><dt><span class="section"><a href="ch03s03.html#idm139835488910032">&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</a></span></dt><dt><span class="section"><a href="ch03s03.html#idm139835488897616"></a></span></dt></dl></dd><dt><span class="section"><a href="ch03s04.html">&#1054;&#1073;&#1083;&#1072;&#1082;&#1072;</a></span></dt><dd><dl><dt><span class="section"><a href="ch03s04.html#idm139835488883040"></a></span></dt></dl></dd></dl></div><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="idm139835488964272"></a>&#1053;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</h2></div></div></div><div class="section"><div class="titlepage"></div><p>
				&#1041;&#1077;&#1079;&#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;, &#1095;&#1077;&#1084; &#1074;&#1099;&#1096;&#1077; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1090;&#1077;&#1084; &#1083;&#1091;&#1095;&#1096;&#1077; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1086;&#1089;&#1090;&#1072;&#1105;&#1090;&#1089;&#1103; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;
				"&#1085;&#1072;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1099;&#1096;&#1077;?".
			</p><p><a name="pb"></a>
				&#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1091; &#1085;&#1072;&#1089; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1092;&#1072;&#1081;&#1083;, &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; 7 &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;. &#1054;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1080;&#1084; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1073;&#1086;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1082;&#1072;&#1082;
				p(f), &#1072; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1073;&#1086;&#1103; &#1073;&#1083;&#1086;&#1082;&#1072; &#1082;&#1072;&#1082; p(b).
				</p><div class="tip" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072;</h3><p>
						&#1058;&#1077;&#1088;&#1084;&#1080;&#1085; <span class="emphasis"><em>&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1073;&#1086;&#1103;</em></span> &#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1086;&#1075;&#1086; &#1087;&#1077;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;
						&#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1085;&#1077; &#1089;&#1084;&#1086;&#1075;&#1083;&#1080; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;.
						&#1058;.&#1077;. &#1077;&#1089;&#1083;&#1080; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1073;&#1086;&#1103; &#1088;&#1072;&#1074;&#1085;&#1072; 1%, &#1090;&#1086; &#1074; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1084; &#1080;&#1079; 100 &#1095;&#1090;&#1077;&#1085;&#1080;&#1081; &#1086;&#1076;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1085;&#1099;&#1084;. &#1055;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;,
						&#1095;&#1090;&#1086; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1077; &#1095;&#1090;&#1077;&#1085;&#1080;&#1077;(&#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1073;&#1086;&#1103;) &#1083;&#1080;&#1073;&#1086; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;, &#1083;&#1080;&#1073;&#1086; &#1076;&#1072;&#1089;&#1090; &#1090;&#1086;&#1078;&#1077; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#8212;
						&#1091;&#1084;&#1077;&#1088;&#1083;&#1072;, &#1090;&#1072;&#1082; &#1091;&#1084;&#1077;&#1088;&#1083;&#1072;.
					</p><p>
						&#1040; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085; <span class="emphasis"><em>&#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;</em></span> &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1090;.&#1077;. &#1077;&#1089;&#1083;&#1080; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;
						&#1089;&#1073;&#1086;&#1103; &#1088;&#1072;&#1074;&#1085;&#1072; 1%, &#1090;&#1086; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; 100%-1%=99%.
					</p></div><p>
			</p><p>
				&#1054;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080; &#1089;&#1077;&#1084;&#1080; &#1073;&#1083;&#1086;&#1082;&#1072;&#1093;, &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1073;&#1086;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1089;&#1077;&#1084;&#1100; &#1088;&#1072;&#1079; &#1074;&#1099;&#1096;&#1077; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1073;&#1086;&#1103; &#1073;&#1083;&#1086;&#1082;&#1072;.
				</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3>
					&#1071; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;, &#1095;&#1090;&#1086; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1073;&#1086;&#1103; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1084;&#1072;&#1083;&#1072;.
				</div><p>
				&#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1092;&#1072;&#1081;&#1083; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1088;&#1095;&#1077;&#1085; &#1087;&#1088;&#1080; &#1087;&#1086;&#1088;&#1095;&#1077; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1080;&#1079; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;.
			</p><p>
				&#1063;&#1090;&#1086;-&#1078;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1076;&#1105;&#1090; &#1087;&#1088;&#1080; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;? &#1069;&#1090;&#1086; &#1074;&#1080;&#1076;&#1085;&#1086; &#1085;&#1072; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1072;&#1093;:
			</p><p>
				</p><div class="mediaobject"><img src="448.png"></div><p>
				&#1058;&#1091;&#1090; &#1087;&#1086; &#1086;&#1089;&#1080; &#1072;&#1073;&#1089;&#1089;&#1094;&#1080;&#1089;&#1089; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1073;&#1086;&#1103; &#1073;&#1083;&#1086;&#1082;&#1072; p(b), &#1072; &#1087;&#1086; &#1086;&#1089;&#1080; &#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#8212; &#1074;&#1089;&#1077;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; p(f).
			</p><p>
				&#1058;&#1091;&#1090; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; p(b) &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; 5%, &#1090;&#1086; p(f) &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; 0%
				</p><div class="caution" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1042;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;</h3><p>
						&#1053;&#1086; &#1053;&#1045; &#1085;&#1086;&#1083;&#1100;. &#1058;&#1072;&#1082;, &#1077;&#1089;&#1083;&#1080; p(b)=0.5%, &#1090;&#1086; p(f)=0.001%. &#1058;.&#1077;. &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1073;&#1083;&#1080;&#1079;&#1082;&#1072; &#1082; 100%,
						&#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1053;&#1045; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090; 100%, &#1093;&#1086;&#1090;&#1103; &#1080; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1072;.
					</p><p>
						&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1077;&#1097;&#1105; &#1088;&#1072;&#1079; &#1076;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;, &#1095;&#1090;&#1086; 100% &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1080; &#1076;&#1072;&#1105;&#1090; &#1083;&#1080;&#1096;&#1100; &#1084;&#1105;&#1088;&#1090;&#1074;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;.
					</p></div><p>
				&#1042; &#1080;&#1090;&#1086;&#1075;&#1077;, &#1087;&#1088;&#1080; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;, &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1089;&#1077;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1084;&#1085;&#1086;&#1075;&#1086;&#1082;&#1088;&#1072;&#1090;&#1085;&#1086; &#1087;&#1086;&#1074;&#1099;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1080; &#1095;&#1077;&#1084; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1077;&#1077; &#1073;&#1083;&#1086;&#1082;,
				&#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1087;&#1086;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;.
			</p><p>
				&#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1087;&#1086;&#1089;&#1083;&#1077; p(b)=5%, &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1087;&#1072;&#1076;&#1072;&#1090;&#1100;. &#1047;&#1076;&#1077;&#1089;&#1100; p(b)=p(f) &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1085;&#1072; 15%, &#1080; &#1089; &#1088;&#1086;&#1089;&#1090;&#1086;&#1084; p(b),
				p(f) &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1072;&#1077;&#1090; &#1077;&#1097;&#1105; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;, &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080;-&#1073;&#1099; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1077;&#1073;&#1099;&#1083;&#1086;.
			</p><p>
				&#1042; &#1080;&#1090;&#1086;&#1075;&#1077; &#1084;&#1099; &#1080;&#1084;&#1077;&#1077;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099;&#1081; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;: &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100;, &#1095;&#1090;&#1086; p(b) &#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1086; &#1088;&#1072;&#1089;&#1090;&#1105;&#1090; &#1089; &#1090;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1079;-&#1079;&#1072; &#1076;&#1077;&#1075;&#1088;&#1072;&#1076;&#1072;&#1094;&#1080;&#1080;
				&#1092;&#1083;&#1077;&#1096;-&#1087;&#1072;&#1084;&#1103;&#1090;&#1080;), &#1090;&#1086; &#1073;&#1077;&#1079; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1101;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1083;&#1086;-&#1073;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1082; &#1083;&#1080;&#1085;&#1077;&#1081;&#1085;&#1086;&#1084;&#1091; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1085;&#1080;&#1102; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;. &#1053;&#1086; &#1089; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;
				&#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1072; &#1080;&#1085;&#1072;&#1103;: &#1087;&#1077;&#1088;&#1074;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1085;&#1077;&#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1072; (&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1087;&#1088;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1072;, &#1091; &#1084;&#1077;&#1085;&#1103; &#1090;&#1091;&#1090;
				2 &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1093; &#1073;&#1083;&#1086;&#1082;&#1072; &#1085;&#1072; 7 &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093;), &#1079;&#1072;&#1090;&#1077;&#1084;, &#1095;&#1080;&#1089;&#1083;&#1086; &#1089;&#1073;&#1086;&#1081;&#1085;&#1099;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1042;&#1053;&#1045;&#1047;&#1040;&#1055;&#1053;&#1054; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1103; &#1074; &#1085;&#1077;&#1075;&#1086;&#1076;&#1085;&#1086;&#1089;&#1090;&#1100; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;
				&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1082;&#1072;&#1085;&#1072;&#1083; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080;.
				</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3>
					&#1069;&#1090;&#1086;, &#1082;&#1089;&#1090;&#1072;&#1090;&#1080;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1083;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; <a class="link" href="matrix.html#system_encode" title="&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080; &#1085;&#1077;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;">&#1085;&#1077;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</a>.
					&#1045;&#1097;&#1105; &#1086;&#1076;&#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;: &#1077;&#1089;&#1083;&#1080; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1087;&#1086;&#1095;&#1090;&#1080; &#1085;&#1077;&#1090;, &#1090;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103;
					&#1076;&#1077;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1091;&#1083;&#1077;&#1074;&#1086;&#1077;. &#1053;&#1086; &#1086;&#1085;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1072;&#1077;&#1090;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086;. &#1069;&#1090;&#1086; &#1074;&#1072;&#1078;&#1085;&#1086; &#1074;
					&#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1089; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1081; &#1089;&#1074;&#1103;&#1079;&#1080;: &#1076;&#1086;&#1085;&#1086;&#1088;&#1099; &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1074;&#1089;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;,
					&#1085;&#1086; &#1088;&#1077;&#1094;&#1080;&#1087;&#1080;&#1077;&#1085;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1083;&#1080;&#1096;&#1100; &#1090;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1077;&#1084;&#1091; &#1087;&#1088;&#1086;&#1097;&#1077; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100;. &#1053;&#1072;&#1073;&#1086;&#1088; &#1101;&#1090;&#1080;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1091; &#1076;&#1086;&#1085;&#1086;&#1088;&#1072; &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1081;,
					&#1080; &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1080;&#1084;&#1080; &#1086;&#1082;&#1072;&#1078;&#1091;&#1090;&#1089;&#1103; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080; c&#8320;,c&#8321;,c&#8322;&#8230; &#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1085;&#1072;. &#1055;&#1086;&#1090;&#1086;&#1084;&#1091; &#1074; &#1086;&#1073;&#1097;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1072;&#1073;&#1086;&#1088; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;
					&#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1081;. &#1053;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1101;&#1090;&#1086; &#1090;&#1086;&#1078;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1084;&#1072;&#1083;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
					&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076;&#1077;&#1088; &#1090;&#1072;&#1084;, &#1075;&#1076;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1082;&#1086;&#1076;&#1077;&#1088;&#1099; &#1085;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;.
				</div><p>
			</p></div></div></div></body></html>
