<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1061;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="zz"><link rel="up" href="chapter3.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;"><link rel="prev" href="chapter3.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;"><link rel="next" href="ch03s03.html" title="&#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086; &#1057;&#1077;&#1090;&#1080;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="idm139835488929440"></a>&#1061;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h2></div></div></div><p>
			&#1054;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1089;&#1072;&#1084;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1085;&#1072; &#1085;&#1077;&#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1084; &#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1077;(&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1103;&#1093;),
			&#1089;&#1102;&#1076;&#1072; &#1078;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081; &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;.
		</p><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="idm139835488927920"></a>&#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;</h3></div></div></div><p>
				&#1045;&#1089;&#1083;&#1080; &#1084;&#1099; &#1080;&#1084;&#1077;&#1077;&#1084; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;, &#1086;&#1073;&#1098;&#1105;&#1084; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1086;&#1073;&#1098;&#1105;&#1084;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1090;&#1086; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100;
				&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;.
			</p><p>
				&#1050; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, &#1080;&#1084;&#1077;&#1103; <a class="link" href="chapter3.html#pb">p(b)</a>=1% &#1080; &#1092;&#1072;&#1081;&#1083; &#1080;&#1079; 7&#1080; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;, p(f) &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1086;&#1083;&#1086; 7% (&#1090;&#1086;&#1095;&#1085;&#1077;&#1077; 6.723%). &#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1074;
				&#1074;&#1086;&#1089;&#1100;&#1084;&#1086;&#1081; &#1073;&#1083;&#1086;&#1082; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; p(f) &#1091;&#1078;&#1077; 0.27%, &#1072; &#1077;&#1089;&#1083;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1077;&#1097;&#1105; &#1086;&#1076;&#1080;&#1085;(7+2), &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; 0.01%. &#1058;.&#1086;. &#1087;&#1088;&#1080; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1080;
				&#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1076;&#1086; 129%, &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1090;&#1077;&#1088;&#1080; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; 100 &#1088;&#1072;&#1079;.
			</p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="idm139835488924608"></a>&#1053;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;</h3></div></div></div><p>
				&#1058;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1088;&#1072;&#1079;&#1073;&#1080;&#1074;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1085;&#1072; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1086;&#1087;&#1072;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1090;&#1100; &#1082;&#1072;&#1082;&#1086;&#1077;-&#1090;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; &#1094;&#1077;&#1083;&#1080;&#1082;&#1086;&#1084;.
			</p><p>
				&#1055;&#1088;&#1072;&#1074;&#1076;&#1072; &#1089; &#1076;&#1074;&#1091;&#1084;&#1103; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;&#1084;&#1080; &#1101;&#1090;&#1086; &#1085;&#1080;&#1095;&#1077;&#1084; &#1085;&#1077; &#1083;&#1091;&#1095;&#1096;&#1077; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;(&#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072; &#1080;&#1084;&#1077;&#1077;&#1102;&#1090; &#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; 100%).
				&#1054;&#1076;&#1085;&#1072;&#1082;&#1086;, &#1091;&#1078;&#1077; &#1087;&#1088;&#1080; 3&#1093; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;&#1093;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1093;&#1077;&#1084;&#1091; &#1074; 4 &#1073;&#1083;&#1086;&#1082;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; + 2 &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093;. &#1042; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;
				&#1073;&#1091;&#1076;&#1077;&#1090; 2 &#1073;&#1083;&#1086;&#1082;&#1072; (&#8532; &#1092;&#1072;&#1081;&#1083;&#1072;), &#1080; &#1076;&#1083;&#1103; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; 2 &#1080;&#1079; &#1090;&#1088;&#1105;&#1093; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;.
			</p><p>
				&#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086;, &#1080; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1091;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1086;&#1077;(&#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1077;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1086;&#1073;&#1083;&#1072;&#1082;&#1086;) &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;
				&#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077;&#1075;&#1086; &#1086;&#1076;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; 1&#1043;&#1073;, &#1076;&#1083;&#1103; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; 1.4&#1043;&#1073; (&#1074; &#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1084; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;
				&#1101;&#1090;&#1086;&#1090; &#1092;&#1072;&#1081;&#1083; &#1073;&#1091;&#1076;&#1077;&#1090; &#1094;&#1077;&#1083;&#1080;&#1082;&#1086;&#1084;). &#1058;&#1086;&#1075;&#1076;&#1072; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1089;&#1103; &#1074;&#1099;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; 0.4&#1043;&#1073; &#1080;&#1079; &#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1075;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;, &#1085;&#1086; &#1077;&#1089;&#1083;&#1080;
				&#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086;, &#1090;&#1086; &#1080; &#1082;&#1072;&#1095;&#1072;&#1090;&#1100; &#1085;&#1091;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1084; 40% &#1092;&#1072;&#1081;&#1083;&#1072;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074;&#1099;&#1073;&#1086;&#1088; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1074; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077;
				&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090;. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1072;&#1078;&#1085;&#1086;, &#1090;.&#1082;. &#1092;&#1072;&#1081;&#1083;&#1099; &#1074; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100; &#1085;&#1077; &#1075;&#1083;&#1103;&#1076;&#1103;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;
				&#1080;&#1093; SHA1. &#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1080;&#1082;&#1072;&#1082; &#1085;&#1077; &#1087;&#1086;&#1074;&#1083;&#1080;&#1103;&#1077;&#1090; &#1085;&#1072; &#1089;&#1088;&#1077;&#1076;&#1085;&#1102;&#1102; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1080; &#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1081; &#1086;&#1073;&#1098;&#1105;&#1084; &#1079;&#1072;&#1082;&#1072;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089; &#1091;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1086;&#1075;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;.
			</p><p>
				&#1058;.&#1077;. &#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1080;&#1090;&#1100; &#1074; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; 100&#1052;&#1073;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; 100&#1052;&#1073; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;, &#1101;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1105;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086;
				&#1082; &#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072;&#1096;&#1077;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; 1.4&#1043;&#1073; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; 500&#1052;&#1073; &#1080;&#1079; &#1091;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1086;&#1075;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;. &#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;,
				&#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1087;&#1086;&#1090;&#1086;&#1084;(&#1082;&#1086;&#1075;&#1076;&#1072; &#1091; &#1085;&#1072;&#1089; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1089;&#1074;. &#1084;&#1077;&#1089;&#1090;&#1086;) &#1079;&#1072;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; &#1080;&#1079; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072; &#1089;&#1082;&#1072;&#1078;&#1077;&#1084; 200&#1052;&#1073; &#1085;&#1086;&#1074;&#1099;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;, &#1080; &#1090;&#1086;&#1075;&#1076;&#1072; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;
				1.4&#1043;&#1073;-&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077;&#1075;&#1086; 300&#1052;&#1073;, &#1090;.&#1082;. &#1074; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1077; &#1091; &#1085;&#1072;&#1089; &#1091;&#1078;&#1077; 1100&#1052;&#1073;.
				</p><div class="note" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</h3>
					&#1042;&#1089;&#1105; &#1101;&#1090;&#1086; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1074;&#1077;&#1088;&#1085;&#1086; &#1074;&#1086; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1084;, &#1085;&#1072;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080; &#1085;&#1077; &#1087;&#1086;&#1074;&#1077;&#1079;&#1090;&#1080;, &#1080; &#1080;&#1079; &#1091;&#1076;&#1072;&#1083;&#1105;&#1085;&#1085;&#1086;&#1075;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072; &#1087;&#1088;&#1080;&#1076;&#1105;&#1090;&#1089;&#1103;
					&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1052;&#1073;, &#1072; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1099;&#1093;, &#1101;&#1090;&#1086; &#1074;&#1089;&#1105; &#1084;&#1072;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1077;, &#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1101;&#1090;&#1086; &#1083;&#1080;&#1096;&#1100; &#1087;&#1088;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;
					&#1084;&#1077;&#1083;&#1082;&#1080;&#1093; &#1073;&#1083;&#1086;&#1082;&#1072;&#1093;(&#1090;.&#1077;. &#1086;&#1076;&#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1100; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1093;&#1086;&#1090;&#1103;-&#1073;&#1099; 1/10 &#1074;&#1089;&#1077;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;). &#1045;&#1089;&#1083;&#1080; &#1073;&#1083;&#1086;&#1082;&#1080; &#1082;&#1088;&#1091;&#1087;&#1085;&#1099;&#1077;, &#1090;&#1086; &#1074;&#1077;&#1083;&#1080;&#1082;&#1072;
					&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1082;&#1086;&#1083;&#1083;&#1080;&#1079;&#1080;&#1080;, &#1087;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1084;&#1099; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1084; &#1085;&#1077; &#1087;&#1086; 1 &#1073;&#1083;&#1086;&#1082;&#1091; &#1080;&#1079; &#1095;&#1072;&#1089;&#1090;&#1080;, &#1072; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1087;&#1086; 2. &#1069;&#1090;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086;
					&#1087;&#1086;&#1088;&#1090;&#1080;&#1090; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1091;(&#1077;&#1089;&#1083;&#1080; &#1085;&#1072;&#1084; &#1085;&#1077; &#1087;&#1086;&#1074;&#1077;&#1079;&#1083;&#1086;).
				</div><p>
			</p></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="idm139835488915760"></a>&#1050;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</h3></div></div></div><p>
				&#1054;&#1073;&#1099;&#1095;&#1085;&#1086;&#1077; &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1086;&#1084;, &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077;:
				&#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1090;&#1088;&#1072;&#1090;&#1077;&#1075;&#1080;&#1103; &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; "&#1085;&#1077;&#1085;&#1091;&#1078;&#1085;&#1099;&#1081;" &#1092;&#1072;&#1081;&#1083; &#1074; 1000&#1052;&#1073; &#1076;&#1083;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; "&#1085;&#1091;&#1078;&#1085;&#1086;&#1075;&#1086;" &#1074; 100&#1052;&#1073;,
				&#1090;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1099;&#1088;&#1082;&#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; 900&#1052;&#1073;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1077; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1090;&#1086;&#1095;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1082;&#1077;&#1096;&#1077;&#1084;, &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100;
				&#1085;&#1077; &#1074;&#1077;&#1089;&#1100; "&#1085;&#1077;&#1085;&#1091;&#1078;&#1085;&#1099;&#1081;" &#1092;&#1072;&#1081;&#1083; &#1074; 1000&#1052;&#1073;, &#1072; &#1083;&#1080;&#1096;&#1100; 100&#1052;&#1073; &#1080;&#1079; &#1085;&#1077;&#1075;&#1086;. &#1058;&#1086;&#1075;&#1076;&#1072;, &#1077;&#1089;&#1083;&#1080; "&#1085;&#1077;&#1085;&#1091;&#1078;&#1085;&#1099;&#1081;" &#1092;&#1072;&#1081;&#1083; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; "&#1085;&#1091;&#1078;&#1085;&#1099;&#1084;", &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1090;&#1100; &#1074;
				&#1082;&#1077;&#1096; &#1087;&#1088;&#1080;&#1076;&#1105;&#1090;&#1100;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1097;&#1080;&#1077; 100&#1052;&#1073;. &#1058;&#1072;&#1082;&#1072;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1091;&#1089;&#1090;&#1086;&#1081;&#1095;&#1080;&#1074;&#1077;&#1077;, &#1080; &#1086;&#1095;&#1077;&#1085;&#1100; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103;
				&#1102;&#1079;&#1077;&#1088;&#1072;(&#1102;&#1079;&#1077;&#1088;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1080;&#1090;&#1100; "&#1079;&#1072;&#1076;&#1091;&#1084;&#1095;&#1080;&#1074;&#1086;&#1089;&#1090;&#1100;" &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1086;&#1085;&#1072; &#1090;&#1086;&#1088;&#1084;&#1086;&#1079;&#1080;&#1090; "&#1087;&#1086; &#1076;&#1077;&#1083;&#1091;", &#1085;&#1086; &#1085;&#1077;&#1085;&#1072;&#1074;&#1080;&#1076;&#1103;&#1090;, &#1082;&#1086;&#1075;&#1076;&#1072;
				&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1042;&#1053;&#1045;&#1047;&#1040;&#1055;&#1053;&#1054; "&#1079;&#1072;&#1074;&#1080;&#1089;&#1072;&#1077;&#1090;", &#1073;&#1077;&#1079; &#1074;&#1089;&#1103;&#1082;&#1080;&#1093; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1093; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;).
			</p><p>
				&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1084;&#1085;&#1086;&#1075;&#1080;&#1077; &#1060;&#1057; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1091;&#1102;&#1090; &#1089; noatime, &#1095;&#1090;&#1086; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1073;&#1086;&#1088;&#1072; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1080; &#1082;&#1077;&#1096;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;(&#1090;.&#1082;.
				&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1092;&#1072;&#1081;&#1083; &#1073;&#1099;&#1083; &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1088;&#1072;&#1079; "&#1085;&#1091;&#1078;&#1077;&#1085;"). &#1042; &#1090;&#1072;&#1082;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;,
				&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1099; &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;(&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; 214%), &#1072; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1085;&#1091;&#1078;&#1077;&#1085; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;,
				&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1076;&#1086; 214%(&#1077;&#1089;&#1083;&#1080; &#1086;&#1089;&#1090;&#1072;&#1083;&#1086;&#1089;&#1100; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; 100%, &#1090;&#1086; &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1077;&#1090; &#1073;&#1083;&#1086;&#1082;&#1080; &#1080;&#1079; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;). &#1063;&#1077;&#1088;&#1077;&#1079; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;,
				&#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; "&#1085;&#1091;&#1078;&#1085;&#1099;&#1093;" &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081;, &#1072; "&#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1099;&#1077;" &#1073;&#1091;&#1076;&#1091;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1099;&#1090;&#1077;&#1089;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079;
				&#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;.
			</p></div></div></body></html>
