<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086; &#1057;&#1077;&#1090;&#1080;</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="zz"><link rel="up" href="chapter3.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;"><link rel="prev" href="ch03s02.html" title="&#1061;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;"><link rel="next" href="ch03s04.html" title="&#1054;&#1073;&#1083;&#1072;&#1082;&#1072;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="idm139835488910544"></a>&#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1086; &#1057;&#1077;&#1090;&#1080;</h2></div></div></div><div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="idm139835488910032"></a>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</h3></div></div></div><p>
				&#1055;&#1086;&#1076; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1086;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1069;&#1062;&#1055;. &#1045;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; <span class="command"><strong>zz</strong></span>
				&#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#8212; &#1101;&#1090;&#1086; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1072;.
			</p><p>
				&#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1086; &#1084;&#1086;&#1077;&#1084;&#1091; &#1084;&#1085;&#1077;&#1085;&#1080;&#1102;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1096;&#1080;&#1088;&#1086;&#1082;&#1086;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1088;&#1077;&#1095;&#1100; &#1080;&#1076;&#1105;&#1090; &#1087;&#1088;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;
				&#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1094;&#1080;&#1087;&#1080;&#1077;&#1085;&#1090;&#1072;(&#1088;&#1077;&#1094;&#1080;&#1087;&#1080;&#1077;&#1085;&#1090;&#1086;&#1074;) &#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1087;&#1086;&#1076;&#1083;&#1080;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1077;&#1089;&#1090;&#1100; &#1080; &#1077;&#1097;&#1105; &#1086;&#1076;&#1085;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072;: &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;
				&#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072; &#1087;&#1086; &#1087;&#1091;&#1090;&#1080; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1080; &#1101;&#1090;&#1086; &#1087;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1085;&#1077;&#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;.
			</p><p>
				&#1056;&#1077;&#1095;&#1100; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1085;&#1077; &#1087;&#1088;&#1086; &#1041;&#1041;/&#1050;&#1043;&#1041;/&#1062;&#1056;&#1059;, &#1074;&#1089;&#1105; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1072;&#1085;&#1072;&#1083;&#1100;&#1085;&#1077;&#1077;. &#1055;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1077;&#1089;&#1100; &#1090;&#1088;&#1072;&#1092;&#1080;&#1082; &#1085;&#1072; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1090;&#1097;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;,
				&#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1077;&#1091;&#1089;&#1087;&#1077;&#1083;&#1072; &#1074; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077;&#1086;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1085;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; "&#1050;&#1086;&#1088;&#1087;&#1086;&#1088;&#1072;&#1094;&#1080;&#1103; &#1044;&#1086;&#1073;&#1088;&#1072;" (aka Google, &#1077;&#1089;&#1083;&#1080;
				&#1082;&#1090;&#1086; &#1085;&#1077; &#1087;&#1086;&#1085;&#1103;&#1083;). &#1053;&#1077; &#1086;&#1090;&#1089;&#1090;&#1072;&#1102;&#1090; &#1086;&#1090; &#1085;&#1077;&#1105; &#1080; &#1088;&#1072;&#1079;&#1085;&#1072;&#1103; &#1084;&#1077;&#1083;&#1086;&#1095;&#1100;, &#1074; &#1090;.&#1095;. &#1080; &#1085;&#1072;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103;, &#1088;&#1086;&#1089;&#1089;&#1080;&#1081;&#1089;&#1082;&#1072;&#1103;(yandex, mail.ru, &#1080; &#1077;&#1097;&#1105; Over9000).
			</p><p>
				&#1042;&#1089;&#1077; &#1101;&#1090;&#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1090;&#1091;&#1102;&#1090; &#1079;&#1072; "&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;", &#1085;&#1086; &#1076;&#1100;&#1103;&#1074;&#1086;&#1083; &#1074; &#1076;&#1077;&#1090;&#1072;&#1083;&#1103;&#1093;: <span class="emphasis"><em>&#1086;&#1090;&#1082;&#1091;&#1076;&#1072;</em></span> &#1080;
				<span class="emphasis"><em>&#1082;&#1091;&#1076;&#1072;</em></span> &#1086;&#1085;&#1080; "&#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;"?
			</p><p>
				&#1056;&#1072;&#1079;&#1075;&#1072;&#1076;&#1082;&#1072; &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;: &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099; &#1101;&#1090;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090; &#1074;&#1072;&#1089;, &#1091;&#1074;&#1072;&#1078;&#1072;&#1077;&#1084;&#1099;&#1081; &#1095;&#1080;&#1090;&#1072;&#1090;&#1077;&#1083;&#1100;, &#1080; &#1082; &#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1072;&#1096;&#1077;&#1084;&#1091; &#1075;&#1091;&#1075;&#1083;&#1091;.
			</p><p>
				&#1040; &#1074;&#1086;&#1090; &#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1086;&#1085;&#1080; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077;, &#1080; &#1084;&#1099; &#1076;&#1072;&#1078;&#1077; &#1090;&#1086;&#1083;&#1082;&#1086;&#1084; &#1085;&#1077; &#1079;&#1085;&#1072;&#1077;&#1084;,
				<span class="emphasis"><em>&#1095;&#1090;&#1086;</em></span> &#1086;&#1085;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;. &#1050;&#1086;&#1089;&#1074;&#1077;&#1085;&#1085;&#1086; &#1086;&#1073; &#1101;&#1090;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1091;&#1076;&#1080;&#1090;&#1100; &#1087;&#1086; &#1088;&#1072;&#1079;&#1085;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1085;&#1099;&#1084; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1084; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1082;&#1072;&#1084;,
				&#1086;&#1090;&#1082;&#1091;&#1076;&#1072; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1074;&#1072;&#1096; &#1096;&#1072;&#1075;, &#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1082;&#1083;&#1080;&#1082;.
			</p><p>
				&#1069;&#1090;&#1072; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086;&#1090;&#1085;&#1102;&#1076;&#1100; &#1085;&#1077; &#1101;&#1092;&#1080;&#1084;&#1077;&#1088;&#1085;&#1072;&#1103; &#8212; &#1077;&#1105; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1076;&#1072;&#1090;&#1100;, &#1082;&#1091;&#1087;&#1080;&#1090;&#1100;, &#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080; &#1091;&#1082;&#1088;&#1072;&#1089;&#1090;&#1100;. &#1050;&#1086;&#1084;&#1091; &#1086;&#1085;&#1072; &#1076;&#1086;&#1089;&#1090;&#1072;&#1085;&#1077;&#1090;&#1089;&#1103; &#8212;
				&#1085;&#1077;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;. &#1053;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1077;&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1086;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1085;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; <span class="emphasis"><em>&#1082;&#1086;&#1084;&#1091; &#1091;&#1075;&#1086;&#1076;&#1085;&#1086;</em></span>.
			</p><p>
				&#1053;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1085;&#1077;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1072;, &#1090;.&#1082;. &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090; &#1080; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086;
				&#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; (&#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085;, &#1085;&#1077;&#1078;&#1077;&#1083;&#1080; &#1082;&#1086;&#1076; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1085;&#1080;&#1090;&#1100; OS Windows&#8482;, &#1082;&#1086;&#1076; &#1089;&#1074;&#1086;&#1077;&#1081; &#1054;&#1057; &#1074;&#1099; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
				&#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1076;&#1080;&#1079;&#1072;&#1089;&#1089;&#1077;&#1084;&#1073;&#1083;&#1077;&#1088;&#1086;&#1084;, &#1085;&#1086; &#1089; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1084; &#1090;&#1072;&#1082;&#1086;&#1081; &#1092;&#1086;&#1082;&#1091;&#1089; &#1085;&#1077; &#1087;&#1088;&#1086;&#1081;&#1076;&#1105;&#1090;). &#1044;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1082;&#1086;&#1076; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;
				&#1073;&#1077;&#1079;&#1086;&#1073;&#1080;&#1076;&#1077;&#1085;, &#1090;&#1086; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1073;&#1077;&#1079; &#1074;&#1089;&#1103;&#1082;&#1080;&#1093; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1081; &#1077;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;.
			</p><p>
				&#1069;&#1090;&#1086; &#1074;&#1089;&#1105; &#1085;&#1077; &#1090;&#1072;&#1081;&#1085;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; mail.ru &#1074; EULA &#1082; &#1089;&#1074;&#1086;&#1077;&#1084;&#1091; &#1075;&#1086;&#1074;&#1085;&#1086;&#1086;&#1073;&#1083;&#1072;&#1082;&#1091; &#1088;&#1091;&#1089;&#1089;&#1082;&#1080;&#1084; &#1087;&#1086; &#1073;&#1077;&#1083;&#1086;&#1084;&#1091; &#1087;&#1080;&#1096;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077;
				&#1092;&#1072;&#1081;&#1083;&#1099; &#1074; &#1077;&#1105; &#1086;&#1073;&#1083;&#1072;&#1082;&#1077; &#1087;&#1088;&#1077;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1090; &#1091;&#1078;&#1077; &#1077;&#1081;, &#1072; &#1085;&#1077; &#1074;&#1072;&#1084;. &#1048; &#1101;&#1090;&#1086; &#1077;&#1097;&#1105; &#1085;&#1077; &#1089;&#1072;&#1084;&#1099;&#1081; &#1093;&#1091;&#1076;&#1096;&#1080;&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;, &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;,
				&#1074; &#1084;&#1072;&#1080;&#1083;&#1088;&#1091;-&#1086;&#1073;&#1083;&#1072;&#1082;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1079;&#1072;&#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;, &#1085;&#1086; &#1087;&#1086;&#1087;&#1088;&#1086;&#1073;&#1091;&#1081;&#1090;&#1077; &#1087;&#1088;&#1086;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;&#1086;&#1077; &#1074; &#1075;&#1091;&#1075;&#1083;&#1086;&#1076;&#1086;&#1082;&#1089;&#1072;&#1093;. &#1059;&#1074;&#1099;,
				&#1074; &#1082;&#1083;&#1091;&#1073;&#1077; &#1083;&#1086;&#1088;&#1076;&#1086;&#1074; &#1074;&#1077;&#1088;&#1103;&#1090; &#1085;&#1072; &#1089;&#1083;&#1086;&#1074;&#1086;&#8230;
			</p></div><div class="section"><div class="titlepage"></div><p>
				&#1048;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1077; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1097;&#1080;&#1090;&#1080;&#1090;&#1100; &#1086;&#1090; &#1101;&#1090;&#1086;&#1081; &#1091;&#1075;&#1088;&#1086;&#1079;&#1099;, &#1087;&#1088;&#1080;&#1095;&#1105;&#1084; &#1076;&#1074;&#1091;&#1084;&#1103; &#1087;&#1091;&#1090;&#1103;&#1084;&#1080;:
				</p><div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem"><p>
							&#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1074;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;, &#1077;&#1105; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; <span class="emphasis"><em>&#1085;&#1072;&#1081;&#1090;&#1080;</em></span>.
							&#1053;&#1086; &#1087;&#1086;&#1080;&#1089;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1086;&#1089;&#1083;&#1086;&#1078;&#1085;&#1105;&#1085;
							<a class="link" href="matrix.html#system_encode" title="&#1057;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1080; &#1085;&#1077;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;">&#1085;&#1077;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;</a>, &#1080;&#1079;-&#1079;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086;
							&#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1073;&#1083;&#1086;&#1082;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1077;&#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1084;&#1099; &#1086;&#1090; &#1073;&#1077;&#1083;&#1086;&#1075;&#1086; &#1096;&#1091;&#1084;&#1072;.
						</p><p>
							&#1053;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1085;&#1077; &#1093;&#1074;&#1072;&#1090;&#1080;&#1090; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; <span class="emphasis"><em>&#1074;&#1089;&#1077;&#1093;</em></span> &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;,
							&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1103;, &#1095;&#1090;&#1086; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1091; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1090;&#1100; &#1087;&#1086;&#1095;&#1090;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;.
						</p><p>
							&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; (&#1080; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086;) &#1086;&#1090; &#1094;&#1077;&#1083;&#1077;&#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1072;&#1090;&#1072;&#1082;&#1080; &#1085;&#1072; &#1092;&#1072;&#1081;&#1083;,
							&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084; &#1087;&#1086;&#1080;&#1089;&#1082; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1089;&#1090;&#1072;&#1090;&#1080;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1087;&#1088;&#1080;&#1079;&#1085;&#1072;&#1082;&#1072;&#1084;
							&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1090;&#1091;&#1088;&#1072;&#1084;
						</p></li><li class="listitem"><p>
							&#1057;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1084; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1077; &#1074;&#1077;&#1089;&#1100; &#1092;&#1072;&#1081;&#1083;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;
							&#1085;&#1077;&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;. &#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1090;&#1072;&#1082;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1090;&#1086;&#1078;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;.
							(<a class="link" href="arithm.html#no_recover" title="&#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;&#1084; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;">&#1057;&#1084;. &#1074;&#1099;&#1096;&#1077;</a>)
							</p><div class="warning" style="margin-left: 0.5in; margin-right: 0.5in;"><h3 class="title">&#1055;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;</h3>
								&#1058;&#1072;&#1082;&#1080; &#1077;&#1097;&#1105; &#1088;&#1072;&#1079; &#1085;&#1072;&#1087;&#1086;&#1084;&#1085;&#1102;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1091; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; <span class="emphasis"><em>&#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086;</em></span>
								&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1044;&#1083;&#1103; &#1096;&#1080;&#1092;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1077;&#1089;&#1090;&#1100; GnuPG.
							</div><p>
						</p></li></ol></div><p>
			</p><p>
				&#1042;&#1089;&#1105; &#1101;&#1090;&#1086; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1089;&#1077;&#1090;&#1077;&#1074;&#1099;&#1093; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;&#1093;, &#1085;&#1086; &#1080; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1091;&#1085;&#1082;&#1090; &#8470;2 &#1073;&#1091;&#1076;&#1077;&#1090;
				&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1087;&#1086;&#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1087;&#1091;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074; &#1074; &#1057;&#1077;&#1090;&#1080; &#1090;&#1088;&#1091;&#1076;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1082;&#1072;&#1079;&#1091;&#1077;&#1084;, &#1080; &#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1088;&#1072;&#1092;&#1080;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;
				&#1083;&#1080;&#1096;&#1100; &#1074; &#1076;&#1074;&#1091;&#1093; &#1090;&#1086;&#1095;&#1082;&#1072;&#1093;, &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1080; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; &#1087;&#1091;&#1090;&#1080;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1086;&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1077; &#1072;&#1073;&#1086;&#1085;&#1077;&#1085;&#1090;&#1089;&#1082;&#1080;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072; ISP &#1080; &#1090;&#1072;&#1082; &#1087;&#1077;&#1088;&#1077;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1099;,
				&#1090;.&#1095;. &#1074;&#1079;&#1074;&#1072;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1085;&#1080;&#1093; &#1090;&#1072;&#1082;&#1091;&#1102; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1085;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1091; &#1085;&#1080;&#1082;&#1090;&#1086; &#1085;&#1077; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090;.
			</p></div></div></body></html>
