<html><head><meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1080;&#1076;&#1077;&#1103; zz</title><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="zz"><link rel="up" href="index.html" title="zz"><link rel="prev" href="index.html" title="zz"><link rel="next" href="chapter1.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="preface"><div class="titlepage"><div><div><h1 class="title"><a name="overview"></a>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1080;&#1076;&#1077;&#1103; zz</h1></div></div></div><p>
			<a name="idm139835491199552"></a>
			<a name="idm139835491038400"></a>
			&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; <span class="command"><strong>zz</strong></span> &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1072; &#1076;&#1083;&#1103; <span class="emphasis"><em>&#1085;&#1072;&#1076;&#1105;&#1078;&#1085;&#1086;&#1075;&#1086;</em></span> &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;/&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080;
			&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1080;&#1076;&#1077;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1074;&#1093;&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1085;&#1072; &#1095;&#1072;&#1089;&#1090;&#1080;(parts), &#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081;
			&#1095;&#1072;&#1089;&#1090;&#1080;, &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;, &#1085;&#1072; &#1073;&#1083;&#1086;&#1082;&#1080;(blocks). &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1074;&#1089;&#1077;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1095;&#1072;&#1089;&#1090;&#1100;, <span class="emphasis"><em>&#1073;&#1086;&#1083;&#1100;&#1096;&#1077;</em></span>
			&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; <span class="command"><strong>zz</strong></span> &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;.
		</p><p>
			&#1060;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1085;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1102; &#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1089;&#1086;&#1088;&#1086;&#1074;(e.g. gzip, bzip2, xz, etc).
		</p><p>
			&#1057;&#1084;&#1099;&#1089;&#1083; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;-&#1073;&#1099; &#1087;&#1086;&#1089;&#1083;&#1077; &#1085;&#1077;&#1080;&#1079;&#1073;&#1077;&#1078;&#1085;&#1086;&#1081; &#1087;&#1086;&#1090;&#1077;&#1088;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080;, &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086;-&#1073;&#1099;
			&#1074;&#1089;&#1105; &#1088;&#1072;&#1074;&#1085;&#1086; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100;.
		</p><p>
			&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1081; &#1076;&#1083;&#1103; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1088;&#1072;&#1074;&#1085;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1091; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1076;&#1083;&#1103;
			&#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; <span class="emphasis"><em>&#1083;&#1102;&#1073;&#1086;&#1081;</em></span> &#1085;&#1072;&#1073;&#1086;&#1088; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;
			&#1086;&#1076;&#1085;&#1091; &#1095;&#1072;&#1089;&#1090;&#1100;.
		</p><p>
			&#1042; &#1089;&#1072;&#1084;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1080;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1080;&#1090;&#1100;&#1089;&#1103; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1090;.&#1077;. &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;,
			&#1085;&#1086; &#1080; &#1082;&#1086;&#1087;&#1080;&#1080;. &#1050; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1092;&#1072;&#1081;&#1083; &#1074; 1&#1043;&#1073;, &#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1077;&#1075;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1074; &#1076;&#1074;&#1091;&#1093; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;&#1072;&#1093;, &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; &#1074; 1&#1043;&#1073;. &#1045;&#1089;&#1083;&#1080;
			&#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1090;&#1077;&#1088;&#1080; p = .1 = 10%, &#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1074;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086;&#1090;&#1077;&#1088;&#1080; &#1089;&#1086;&#1082;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1076;&#1086; p^2 = .01 = 1%.
		</p><p>
			&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1077; &#1091; &#1085;&#1072;&#1089; &#1092;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077;&#1090; &#1076;&#1074;&#1091;&#1093; &#1093;&#1088;&#1072;&#1085;&#1080;&#1083;&#1080;&#1097;. &#1053;&#1072; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1082;&#1080; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1095;&#1090;&#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1072;&#1103;:
			&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1092;&#1083;&#1077;&#1096;&#1082;&#1072; &#1074; 2&#1043;&#1073;(&#1090;&#1086;&#1095;&#1085;&#1077;&#1077; &#1074; 2`000`000`000&#1073;&#1072;&#1081;&#1090;, &#1090;.&#1077;. &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; 1.8626&#1043;&#1073;), &#1080; &#1085;&#1072;&#1084; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1090;&#1091;&#1076;&#1072; &#1092;&#1072;&#1081;&#1083;
			&#1074; 1400&#1052;&#1073;, &#1090;.&#1077;. 1.367&#1043;&#1073;. &#1054;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1079;&#1072;&#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1084;&#1099; &#1085;&#1077; &#1089;&#1084;&#1086;&#1078;&#1077;&#1084;, &#1089;&#1084;&#1086;&#1078;&#1077;&#1084; &#1083;&#1080;&#1096;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084;
			&#1090;&#1088;&#1077;&#1090;&#1100; &#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081;. &#1044;&#1083;&#1103; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1091;&#1078;&#1085;&#1072; &#1074;&#1090;&#1086;&#1088;&#1072;&#1103; &#1090;&#1072;&#1082;&#1072;&#1103; &#1092;&#1083;&#1077;&#1096;&#1082;&#1072;, &#1085;&#1086; &#1086;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1090;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1077;&#1084; &#1091;&#1078;&#1077; &#1076;&#1074;&#1077; &#1090;&#1088;&#1077;&#1090;&#1080;.
		</p><p>
			&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1085;&#1072;&#1084; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; "&#1088;&#1072;&#1079;&#1084;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;" &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072; &#1073;&#1083;&#1086;&#1082;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084; &#1080; &#1075;&#1080;&#1073;&#1082;&#1080;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084;, &#1085;&#1077;&#1078;&#1077;&#1083;&#1080;
			&#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;. &#1058;&#1072;&#1082;, <span class="emphasis"><em>&#1095;&#1090;&#1086;-&#1073;&#1099; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1091; &#1085;&#1072;&#1089; &#1086;&#1073;&#1098;&#1105;&#1084;.</em></span>
		</p><p>
			&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1093;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100;-&#1073;&#1099; <span class="emphasis"><em>&#1085;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1086;&#1076;&#1085;&#1091; &#1080; &#1090;&#1091; &#1078;&#1077; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;</em></span>. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100;
			&#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;, &#1085;&#1086; &#1101;&#1090;&#1086; &#1085;&#1077; &#1085;&#1072;&#1096; &#1087;&#1091;&#1090;&#1100;. &#1050;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1089;&#1086;&#1088;&#1099; &#1073;&#1077;&#1079;&#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090; &#1101;&#1090;&#1091; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;, &#1085;&#1086; &#1082; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1083;&#1080;&#1096;&#1100; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; "&#1086;&#1082;&#1085;&#1072;",
			&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1089;&#1103;&#1082;&#1086; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1080; &#1090;&#1077;&#1084; &#1073;&#1086;&#1083;&#1077;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;. &#1052;&#1072;&#1083;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1076;&#1072;&#1078;&#1077; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;,
			&#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1074;&#1077;&#1089;&#1100; &#1072;&#1088;&#1093;&#1080;&#1074;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1084;&#1099; &#1089;&#1077;&#1075;&#1086;&#1076;&#1085;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084; &#1072;&#1088;&#1093;&#1080;&#1074;, &#1090;&#1086; &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;, &#1085;&#1077;&#1078;&#1077;&#1083;&#1080; &#1074;&#1095;&#1077;&#1088;&#1072;&#1096;&#1085;&#1080;&#1081;,
			&#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1087;&#1086;&#1095;&#1090;&#1080; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1095;&#1085;&#1099;.
		</p><p>
			&#1045;&#1089;&#1083;&#1080; &#1084;&#1099; &#1074;&#1099;&#1082;&#1072;&#1095;&#1080;&#1074;&#1072;&#1077;&#1084; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1080;&#1079; &#1089;&#1077;&#1090;&#1080;, &#1090;&#1086; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1088;&#1072;&#1079;&#1085;&#1091;&#1102; &#1094;&#1077;&#1085;&#1091;: &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1080; &#1076;&#1086;&#1089;&#1090;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;&#1084; &#1083;&#1077;&#1075;&#1082;&#1086;,
			&#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1078;&#1076;&#1072;&#1090;&#1100;. &#1042; &#1080;&#1090;&#1086;&#1075;&#1077;, &#1082;&#1072;&#1088;&#1072;&#1074;&#1072;&#1085; &#1076;&#1074;&#1080;&#1078;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100;&#1102; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1077;&#1088;&#1073;&#1083;&#1102;&#1076;&#1072;.  &#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074;&#1099;&#1093;&#1086;&#1076; - &#1089;&#1084;&#1080;&#1088;&#1080;&#1090;&#1100;&#1089;&#1103;
			&#1089; &#1087;&#1086;&#1090;&#1077;&#1088;&#1077;&#1081; "&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1073;&#1083;&#1102;&#1076;&#1086;&#1074;", &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074; &#1095;&#1080;&#1089;&#1083;&#1086; &#1095;&#1072;&#1089;&#1090;&#1077;&#1081;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1085;&#1072;&#1084; &#1085;&#1077; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;, &#1082;&#1072;&#1082;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; "&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081;"
			&#1091; &#1088;&#1077;&#1094;&#1080;&#1087;&#1080;&#1077;&#1085;&#1090;&#1072;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1090;&#1091;&#1090; &#1090;&#1086;&#1078;&#1077; &#1087;&#1088;&#1080;&#1075;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1044;&#1086;&#1085;&#1086;&#1088; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1077;&#1090; &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; 15 &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1085;&#1072; &#1074;&#1099;&#1073;&#1086;&#1088;, &#1072; &#1088;&#1077;&#1094;&#1080;&#1087;&#1080;&#1077;&#1085;&#1090;&#1091;
			&#1085;&#1091;&#1078;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1077;&#1084;&#1100; <span class="emphasis"><em>&#1083;&#1102;&#1073;&#1099;&#1093;</em></span>. &#1058;.&#1082;. &#1094;&#1077;&#1085;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1072; &#1085;&#1077;&#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1079;&#1085;&#1072;&#1103;, &#1090;&#1086; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1074;&#1086;&#1079;&#1088;&#1072;&#1089;&#1090;&#1105;&#1090;.
			&#1054;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1086; &#1074; &#1090;.&#1085;. &#1086;&#1073;&#1083;&#1072;&#1082;&#1072;&#1093;, &#1075;&#1076;&#1077; &#1088;&#1077;&#1094;&#1077;&#1087;&#1080;&#1077;&#1085;&#1090; &#1073;&#1077;&#1088;&#1105;&#1090; &#1073;&#1083;&#1086;&#1082;&#1080; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1076;&#1086;&#1085;&#1086;&#1088;&#1086;&#1074;. &#1060;&#1080;&#1079;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1088;&#1072;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1076;&#1086; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086;
			&#1076;&#1086;&#1085;&#1086;&#1088;&#1072; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;, &#1085;&#1086; &#1073;&#1077;&#1079; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1074;&#1103;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086; &#1074;&#1089;&#1077;&#1084;&#1080; &#1080;&#1079; &#1085;&#1080;&#1093;. &#1053;&#1091; &#1072; &#1089; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; - &#1083;&#1080;&#1096;&#1100; &#1089; &#1089;&#1072;&#1084;&#1099;&#1084;&#1080; &#1073;&#1083;&#1080;&#1079;&#1082;&#1080;&#1084;&#1080;, &#1089;&#1074;&#1103;&#1079;&#1100; &#1089;
			&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084;&#1099; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1099;&#1089;&#1090;&#1088;&#1072;&#1103;.
		</p><p><a class="link" href="index.html" title="zz">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></p><p><a class="link" href="chapter1.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;">&#1055;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</a></p><p><a class="link" href="chapter2.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;">&#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103;</a></p><p><a class="link" href="chapter3.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 3. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;">&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;</a></p></div></body></html>
