Repository: emulek/zz
Catalog: po/*.po
Languages: ru

source: Can't init SHA1
ru: Невозможно инициализировать SHA1

source: Can't final SHA1
ru: Невозможно записать SHA1

source: Error vector:
ru: Синдром ошибки:

source: Load
ru: Загрузка

source: block(s) of
ru: блок(ов) из

source: %sERROR%s
ru: %sНЁХ%s

source: Usage: %s [OPTION]... FILES...
ru: Использование: %s [ОПЦИИ]... ФАЙЛЫ...

source: Options:
ru: Опции:

source: -c, --calculate=EXPRESSIONS Calculate EXPRESSIONS (for GF(%u)).
ru: -c, --calculate=ВЫРАЖЕНИЕ Вычисление ВЫРАЖЕНИЕ (для GF(%u)).

source: -d, --decode Decode file(s).
ru: -d, --decode Декодирование файла(файлов).

source: -h, --help This help.
ru: -h, --help Эта справка.

source: -r, --repository=REPOSITORY Save/Load encode files to/from REPOSITORY.
ru: -r, --repository=РЕПОЗИТОРИЙ Сохранение/Загрузка закодированных файлов в/из РЕПОЗИТОРИЙ.

source: -t, --target-dir=TARGET Decode file(s) to TARGET directory.
ru: -t, --target-dir=ЦЕЛЬ Декодирование файлов в ЦЕЛЬ.

source: -v, --verbose[=VERBOSITY_LEVEL] Verbose output (VERBOSITY_LEVEL={0..9}).
ru: -v, --verbose[=VERBOSITY_LEVEL] Подробный вывод (VERBOSITY_LEVEL={0..9}).

source: -V, --version Version.
ru: -V, --version Версия.

source: %s version %s (HG_REVISION: %s)
ru: %s версия %s (HG_REVISION: %s)

source: License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>.
ru: Лицензия GPLv3+: GNU GPL версия 3 или новее <http://gnu.org/licenses/gpl.html>.

source: This is free software: you are free to change and redistribute it.
ru: Это свободное ПО: вы можете продавать и распространять его.

source: There is NO WARRANTY, to the extent permitted by law.
ru: Нет НИКАКИХ ГАРАНТИЙ до степени, разрешённой законом.

source: Written by drBatty <%s>
ru: Автор drBatty <%s>

source: Invalid argument
ru: Ошибочный аргумент

source: ?? getopt returned character code 0%o ??
ru: ?? непонятная хрень возвращена getopt: 0%o ??

source: -- Command line parsing OK.
ru: -- Успешный разбор командной строки.

source: myname: %s (VERSION: '%s' version_hi: %u, version_low: %u)
ru: имя прораммы: %s (VERSION: '%s' version_hi: %u, version_low: %u)

source: verbosity level: %d
ru: подробность вывода: %d

source: repository directory: '%s'
ru: репозиторий: '%s'

source: target directory: '%s'
ru: целевой каталог: '%s'

source: file #%d: '%s'
ru: файл №%d: '%s'

source: %s: '%s' not aviable: %s
ru: %s: '%s' недоступен: %s

source: no files
ru: файлы не заданы

source: ---------- '%s' encode OK
ru: --------- '%s' кодирование завершено

source: ---------- '%s' decode OK
ru: ---------- '%s' декодирование завершено

source: undefined time
ru: время неопределено
